{
    "selection1":[
    {
    "name":"Which is a better choice, CSE at IIITH or IITH?",
    "url":"https://www.quora.com/Which-is-a-better-choice-CSE-at-IIITH-or-IITH",
    "selection2":"IIITH’s CSE is at par the level of IITB/IITD’s CSE. IITH is also a very good college. If you choose IITH, you will get IIT tag. But IIITH also has its own reputation.One of the top startups in Sillicon Valley, Pocket Gems came to india to hire only IIITH CSE Students. Apple come to India for the recruitment, and they first hired from IIITH. I think you also aware of the fact that IIITH CSE Syllabus is some how better than IITs CSE Syllabus. You don't have to study Science Subjects, mechanics, Engineering Drawing in IIITH. You have to study CSE Subjects from 1st year onwards. Also IIITH’s Coding Culture is famous. Their coding assignment is way more different and difficult than any other engineering colleges in India. Every year they Consistently produce ACM ICPC World Finalists. The select"
    },
    {
    "name":"Why is Apple preferring IIITH over colleges like IIT Bombay, Delhi, Kanpur, Kharagpur and Madras where the best minds of the country reside?",
    "url":"https://www.quora.com/Why-is-Apple-preferring-IIITH-over-colleges-like-IIT-Bombay-Delhi-Kanpur-Kharagpur-and-Madras-where-the-best-minds-of-the-country-reside",
    "selection2":"This information is entirely wrong as Apple is visiting other IITs also, currently they visited IIT Bombay, IIT Guwahati and next would be IIT Kanpur or IIT Delhi. Also the CTC (Cost to Company) offered by them is same in all the colleges (I can not disclose the amount). I think news agencies should avoid spreading such false facts. Apple may have chosen to visit IIITH first because someone in their Talent Acquisition Team might be an alum of the college. There are many factors behind something and we as a responsible and educated citizens must not judge the college based entirely on it’s placement stats."
    },
    {
    "name":"How is life at IIITH?",
    "url":"https://www.quora.com/How-is-life-at-IIITH",
    "selection2":"Student life at IIIT Hyderabad is excellent!! Facilities include: a bank extension counter, ATM machine, stationary shop, and laundry services. The Institute has: * well-equipped, air-conditioned computer laboratories * library has a large collection of Reference Books, Text Books, Technical reports, Standards, Literature books and CDROMS * digital library is also maintained. It is an online archive of useful software, books and tutorials. Students can download any permitted software from this resource. * separate hostels for boys and girls are available on-campus with basic facilities. All the hostel rooms are networked and internet enabled. * institute gives sufficient incentive for everyone to excel in any of the plethora of activities and skills available. Facilities are provided for cricket, volley"
    },
    {
    "name":"IIT CSE vs IIIT Hyderabad CSE vs NIT CSE?",
    "url":"https://www.quora.com/IIT-CSE-vs-IIIT-Hyderabad-CSE-vs-NIT-CSE",
    "selection2":"Personally I would say that IIIT Hyderabad will be a good choice if and only IF you are interested in coding and computer programming! Here at IIIT-H coding is not a subject, it's the culture. IIIT-H Produces the maximum number of competitors for GSoC every year. In 2014 it was 70 , the highest in the world. Starting from the freshman year, we have a Computer programming course in the first semester, and data structures in the second semester. Both of them are programming heavy courses, where students receive regular assignments, and are required to submit that on an internal online judge (which is pretty much exactly similar to SPOJ / CodeChef / CodeForces in format). Mostly your grades depend on how well you do in these assignments. This gets students started in competitive progra"
    },
    {
    "name":"How can I prepare for the UGEE (IIITH) 2020?",
    "url":"https://www.quora.com/How-can-I-prepare-for-the-UGEE-IIITH-2020",
    "selection2":"Applicants in this mode need to appear for a computer-based, undergraduate entrance examination (UGEE) both conducted by IIIT-H.This exam has two sections: Subject Proficiency Test (SUPR) and Research Aptitude Test (REAP) Candidates shortlisted from this exam will have to clear an interview to gain admission. The decision on final offer of admission is solely based on the interview performance. You need to register online and fill an application form to appear for the exam by the announced deadline. a) SUPR -- Subject Proficiency test for 60 minutes. b) REAP -- Research Aptitude Test for 120 minutes. The syllabi for SUPR and REAP are based on XI and XII level of Physics/Maths/Chemistry (CBSE and most state syllabi). However, REAP will have an emphasis on testing critical and creative thinking a"
    },
    {
    "name":"How was the IIITH UGEE 2020?",
    "url":"https://www.quora.com/How-was-the-IIITH-UGEE-2020",
    "selection2":"Exam was from 9:00Am to 12:00(noon). I reached Centre around 7:40 . They checked my risk factor in my phone through Arogya Seth aap. Shooted me with a thermal gun on forehead , provided sanitizer (on outer entrance) Then on inner entrance of building again hands were sanitized and we were told to go 3rd floor.I reached and again they provided with hand sanitizer(3rd time). They took photo and allotted Computer. No Biometric was taken. I sat down and paper started after 50 minutes. section-1 I.e. SUPR contained 50 questions for 1 mark each and no negative marks. It was mostly formula based section. Most of the questions were below Mains level and almost BiTSAT level. Though few questions were moderate long but overall questions were easy. As there were no negative marking I attempted all 50"
    },
    {
    "name":"Which is better choice, CSE at BITS Pilani or CSE at IIITH?",
    "url":"https://www.quora.com/Which-is-better-choice-CSE-at-BITS-Pilani-or-CSE-at-IIITH",
    "selection2":"BITS Pilani > IIITH But academically CSE at IIITH > CSE at BITS pilani. By mentioning academically I mean assignments, course structure, syllabus etc. But life opportunities/exposure at BITS Pilani > IIITH. Also CSE is something which you can learn best by following less on books/syllabus and more on self study/practice/being up to date in technologies. If you want a great placement or would like to build yourself into a tech entrepreneur you can do it in both places but you can do it BITS Pilani by having more fun, exposure and FREEDOM. On a final note IIITH CSE is for a guy who would have to choose between the NITs not BITS Pilani/IITB/IITD/IITKGP/IITM/IITK. I know its in the air that IIITH is good. But I think it has become popular because it is not expected that IIITH CSE/IIITH CSE gr"
    },
    {
    "name":"How hard is it to get into IIITH through JEE?",
    "url":"https://www.quora.com/How-hard-is-it-to-get-into-IIITH-through-JEE",
    "selection2":"With good understanding and strategy, it is pretty easy to get IIIT Hyderabad. Chemistry plays important role for scoring high. If you score a century in chemistry, it makes your work easy in other two subjects in which you need to score only 80+. My score in jee main 2017 was 257 and this score was sufficient for dual degree in CSE. Once again, make chemistry your prime target. Hope this helps."
    },
    {
    "name":"How was the Apple placement in IIIT Hyderabad?",
    "url":"https://www.quora.com/How-was-the-Apple-placement-in-IIIT-Hyderabad",
    "selection2":"It’s nothing less than a big feather in the cap of IIIT Hyderabad as this is the first time ever when Apple will be scouting any Indian college to hire techies. Apple Inc, for the first time, has decided to come to an Indian engineering college with job offers through campus placement. Reportedly, students at the International Institute of Information Technology Hyderabad (IIIT-H) are extremely happy in the wake of Apple’s campus placement drive. As per the report, nearly 350 techies (BTech, BE, MTech and MSc research students) of IIIT Hyderabad have already registered for the placement drive. IIIT-H is an autonomous university. It was founded in 1998. It was set up as a not-for-profit public private partnership (N-PPP) and is the first IIIT to be set up under this model in India. IIIT-H wa"
    },
    {
    "name":"Which one is better IIITH or IIT Guwahati?",
    "url":"https://www.quora.com/Which-one-is-better-IIITH-or-IIT-Guwahati",
    "selection2":"Since you've asked about CS branch. I might be bit biased but it's definitely IIIT-H. Curriculum: IIIT has one of the best and most flexible curriculum in India. There aren't unnecessary courses in first & second year (engineering drawing, HW workshop etc.). lots and lots of optional course in 3rd and fourth, based on your interest you can choose courses in the field of your interest. Placement : IIIT-H placement especially in CS are the best in the country. International Institute of Information Technology (2014) figures speaks for themselves. College Life : no politics, no ragging, excellent infrastructure, campus in Hyderabad, all the fun and frills of big city, good exposure. you can do a quick browse through IIIT-H website to read about the faculty, students. PS:- you'll not get IIT b"
    },
    {
    "name":"Should I follow IIITH's curriculum if I want to be a good programmer?",
    "url":"https://www.quora.com/Should-I-follow-IIITHs-curriculum-if-I-want-to-be-a-good-programmer",
    "selection2":"Curriculum is just a part - IIIT-H is a complete ecosystem that makes such brilliant programmers year by year. Disclaimer: I'm not a part of this top-programmer club of the institute. My answer is from a third-person perspective who interacts with some of the best coders in the IIIT campus everyday. I'm Masters from IIIT-H, and this answer is like a letter to my younger self. The curriculum of IIIT is quite vast - you'll find there're subjects ranging from Gandhian Thought to Game Design to Quantum Computing. First year itself starts with heavy training just like Army drills. 17 year old kids have to get up in the morning and attend PT/Yoga sessions. You take a quick breakfast and go for the classes. Some of the best subject-experts in the worlds teach you the intricate knowledge about the"
    },
    {
    "name":"Hows IIITH for civil engineering?",
    "url":"https://www.quora.com/Hows-IIITH-for-civil-engineering",
    "selection2":"Unlike other colleges IIITH does't have a course for civil engineering. Only computer science engineering(CSE) and Electronics and communication engineering(ECE) courses are available in IIITH."
    },
    {
    "name":"IIIT Hyderabad beats MIT in the number of GSOC takers. Does this mean IIITH produces better computer engineers?",
    "url":"https://www.quora.com/IIIT-Hyderabad-beats-MIT-in-the-number-of-GSOC-takers-Does-this-mean-IIITH-produces-better-computer-engineers",
    "selection2":"Computer engineers don't just contribute to open source, they work in research labs, they file patents, they develop products and they take up software engineering jobs. Using a specific program which targets only a fraction of university level coders and making it a yardstick to compare colleges is simply absurd. Bring in all the numbers of all the possible things that a computer engineer could do and then maybe this question could be logical. Maybe, not even then."
    },
    {
    "name":"What is the difference between the programming culture in IIITH and IIT Bomabay/Delhi?",
    "url":"https://www.quora.com/What-is-the-difference-between-the-programming-culture-in-IIITH-and-IIT-Bomabay-Delhi",
    "selection2":"Well I graduated from IIIT-H and one of my friends from IITB. From what I noticed and what I know from him, there is difference of priorities at these institutes. At IIT, people focus more on overall development both in terms of acads and extra curricullar. My friend got good knowledge of core CS subjects like Databases, OS, Netorking, Data science etc. But they were not too much focused on competitve coding. At IIIT, there is big difference. Almost everyone codes. Even the assignments were coding based. But then there was not as much focus on other areas of CS like Networks , DBMS, Engineering Maths etc compared to IIT. Opportunity wise both are similar. Almost all big software cos. visit IITs and IIIT-H. But they gave harder coding challenges at IIIT-H because of the hype."
    },
    {
    "name":"Is IIITH good for ECE?",
    "url":"https://www.quora.com/Is-IIITH-good-for-ECE",
    "selection2":"Faculty here have done their PhD from reputed institutes across world and are active researchers. Regarding placements, ECE graduates from IIITH have gone to work for all the big companies like NVidia, Qualcomm, Google, Broadcom, Xilinx, Texas, Motorola, Synopsys, Samsung, Amazon, Apple, Infosys, TCS, Oracle. The average salary packages have been close to CS graduates from IIITH. Regarding higher studies, ECE graduates from IIITH have gone to all the top international colleges throughout the world for their Masters/PhD. For example, MIT, CMU, Georgia Tech, NC State University, Rice University, University of SC in US; INRIA in France, Aalto University in Finland, university of Luxembourgh, McGill in Canada and Imperial College, London, UK."
    },
    {
    "name":"What is the difficulty level of the IIITH PGEE Examination with respect to GATE?",
    "url":"https://www.quora.com/What-is-the-difficulty-level-of-the-IIITH-PGEE-Examination-with-respect-to-GATE",
    "selection2":"Thanks for the A2A. I gave PGEE and GATE in 2019 in CSE. In my year, GATE paper was considered very easy which is why the cutoff rose up considerably from 25 to 29.5 64/100 fetched me a rank of 531 which tells you that the paper was easy compared to previous years. In 2019, similar was the case for PGEE, where the aptitude part was good but the technical part was very easy. There were many questions which were repeated from previous year GATE. I remember that there were atleast 10-15 questions out of 60 which was straight out of previous year GATE. I had done previous year very well and so could answer those questions in an instant. This year, I have heard that PGEE CSE was a bit tough as there were good analytical questions asked in the technical part of the paper. Also, the aptitude part w"
    },
    {
    "name":"Which is better for CSE, IIITH or IITB?",
    "url":"https://www.quora.com/Which-is-better-for-CSE-IIITH-or-IITB",
    "selection2":"Coding culture at IIIT-H unparalleled in India. From what I have heard, academically, both institute have different teaching methodology. IITs follow a more generalized approach where you study basics of everything whereas IIIT-H focus on CSE from the get go. GSoC selections, ICPC international ranks speak on their own. IIIT-H CSE placements are on par with old IITs. Having said all this, I would still say that IIT-B is better place. There are things beyond CS studies. IIT is a huge brand name in India and IITs have a reputation outside of India because of their huge alumni network. Whereas IIIT-H is a young institute which is still building it’s alumni network. Being compared with more than half-a-century old institutes as a 2 decade old institute is itself a huge feat. Almost every top r"
    },
    {
    "name":"Which is better, IIITA or IIITH, for competitive programming?",
    "url":"https://www.quora.com/Which-is-better-IIITA-or-IIITH-for-competitive-programming",
    "selection2":"I prefer development over Competitive programming any day of the week. What's its purpose? To prove that your logic is better. Solving 5 problems in 2 hours, which doesnt have any role in your future career as a software specialist makes little sense to me. Instead, if you would have asked that which college has better developers, has won more number of hackathons, then it would be a good question. But since it is CP, I would say both are equally good."
    },
    {
    "name":"How difficult is it to qualify the IIITH UGEE exam?",
    "url":"https://www.quora.com/How-difficult-is-it-to-qualify-the-IIITH-UGEE-exam",
    "selection2":"The UGEE exam is too hard but simple also in perspective of questions difficult level . This exam needs high speed to solve the questions . This exam is difficult in manner of speedy response not in questions difficulty level but you can boost your speed by practicing more and more previous year questions from iitprep. com at free of cost . Free book pdfs are also available in iitprep. com, you will also find the syllabus of UGEE here along with this you can also check UGEE exam pattern at iitprep. com which will not only to speed you preparation but will also make you prepared for jee mains also . After preparing with the help of iitprep. com you can easily become able to fight UGEE like tough exam . Best of luck everyone"
    },
    {
    "name":"What are the cutoff marks for IIITH in the JEE?",
    "url":"https://www.quora.com/What-are-the-cutoff-marks-for-IIITH-in-the-JEE",
    "selection2":"IIITH takes entry based on JEE mains. Their final cutoff were as follows:- For male candidates:- CSE: 99.9 pecentile (AIR 1000) ECE: 99.7 pecentile (AIR 3000) For female candidates:- CSE: 99.77 perecntile (AIR 2800) ECE: 99.5 percentile (AIR 5700) Well, If you find these cutoffs high, but dedicated enough to crack and study in IIITH. You should also attempt other IIITH entrances like UGEE. They are slighly less competetive. Suryabh Bhattacharya''s answer to How can one prepare for the UGEE (IIIT-H) exam?"
    },
    {
    "name":"Is coding culture dying in IIIT-H? In none of Kanpur or Amritapuri do I find an IIITH team in the top 5, but IIIT-H used to produce a world finalist almost every year.",
    "url":"https://www.quora.com/Is-coding-culture-dying-in-IIIT-H-In-none-of-Kanpur-or-Amritapuri-do-I-find-an-IIITH-team-in-the-top-5-but-IIIT-H-used-to-produce-a-world-finalist-almost-every-year",
    "selection2":"Culture of programming at IIIT-H cannot be fully understood by just looking at results of a few programming contests. Structures for knowledge transfer are so deeply rooted I only see signs of it thriving: * It also has a very vibrant programming club - it's fully voluntary to be part of the club. This is completely run by students with absolutely zero intervention of faculty members. Unlike other clubs - contributions to which are recognized at farewell via awards - names of the volunteers for this club are still unwritten. Yet the club organizes internal contests all round the year and conducts algorithms tutorials that attract more attendance than regular classes. Infact a few folks got together to get sponsorships from companies for internal contests as well. Note that this club was start"
    },
    {
    "name":"Considering the high scores on JEE MAINS 2017, what is the expected cutoff for IIITH?",
    "url":"https://www.quora.com/Considering-the-high-scores-on-JEE-MAINS-2017-what-is-the-expected-cutoff-for-IIITH",
    "selection2":"262 is really good. Much wow. Congratulations. Though there is only a slight chance of you getting into IIITH. Seeing the increase in demand over the few years. Students with 1000 rank in IITs will go for IIITH. And the creamy layer of JEE Mains and Advanced will the more or less same only because of the fact that boards marks are not included now. But i still think that may be in the round 4 or 5 you can get IIITH but you will have to wait a lot for that. People usually don’t go that far because it involves a risk factor. And if you don’t get upgraded to CSE then you will have to satisfy either with ECE in IIITH (in case you book it in the previous rounds by paying some money) or nothing at all. But there are many other colleges which you can get in this rank. Colleges such as NSIT and"
    },
    {
    "name":"What should I choose between NITK IT and IIITH ECE?",
    "url":"https://www.quora.com/What-should-I-choose-between-NITK-IT-and-IIITH-ECE",
    "selection2":"Don’t you find difference in ECE and IT as you are asking the question as a comparison between two colleges as well as two different branches. If you ask as NITK IT or CSE and IITH IT or CSE . I would say go for IIITH. This institute is only famous for CSE and IT branches only. As well as the average package that is offered to IITH IT is around 18LPA instead of 11–12 LPA in NITK IT. In IITH, you will get the best environment of CSE and IT than all the NITs and IIITs. But if you are really interested to have an answer to this question, then come to NITK IT instead of going for ECE IITH. ECE at NITK is also the best among all NITs as well as IT is, that’s another thing of having IT in very few colleges. So have a priority to select NITK IT instead of IITH ECE you will find the difference once y"
    },
    {
    "name":"Is UGEE IIITH for average students?",
    "url":"https://www.quora.com/Is-UGEE-IIITH-for-average-students",
    "selection2":"No, it is nothing like that. Anyone can prepare for UGEE IIITH examination. With full dedication and motive anyone can clear the examination.Can take help of *IIT prep* materials for better studies and results :)"
    },
    {
    "name":"What is an IIITH lateral entry interview like?",
    "url":"https://www.quora.com/What-is-an-IIITH-lateral-entry-interview-like",
    "selection2":"Hi, The interview is mostly simple but also depends on your presence of mind.Also I guess they take the college into consideration too. For me as soon as I entered the room they asked about the field I was interested in? I thought they were asking about the respective fields (humanities or linguistics) so I answered accordingly. But I could have just told them a subject and they would have asked questions from there. So that's one thing to remember. You could prepare a subject very well. Rest is all up to your preparation for the interview and a little bit of presence of mind and you are good to go. All the best!! :)"
    },
    {
    "name":"How is Mtech CSE life at IIITH, particularly placements and academics?",
    "url":"https://www.quora.com/How-is-Mtech-CSE-life-at-IIITH-particularly-placements-and-academics",
    "selection2":"Its academics and research are awesome, and placements are also fine. But, if you are getting IIITH, then you must also be getting IITG, I would suggest going for it. In the long run, IITG would be better and placements wise too. PS: Never take IITR."
    },
    {
    "name":"How is an MTech VLSI in IIITH?",
    "url":"https://www.quora.com/How-is-an-MTech-VLSI-in-IIITH",
    "selection2":"Ohh man ! Finally someone has asked this question here. I’m a postgrad from IIIT H VLSI. Sad part is now they have discontinued Masters in VLSI due to lack of professors. Soon they might restart it again. Placements wise it was good the year i was attending placement season. Overall is considerably good. Companies like : Sandisk, Xylinx, Samsung, IBM, Synopsis, Mentor Graphics, Qualcomm, Nvidia, MicroSemi, Texas Instruments etcc visit the campus every year. So dont worry about the placements. Good student always fetches something or the other, Never left alone."
    },
    {
    "name":"Is IIITH CND dual degree good?",
    "url":"https://www.quora.com/Is-IIITH-CND-dual-degree-good",
    "selection2":"It's good! But you should really be research oriented. Ekansh Purohit"
    },
    {
    "name":"Which one should I chose: a CS at the IIT Mandi or a CS at the IIITH?",
    "url":"https://www.quora.com/Which-one-should-I-chose-a-CS-at-the-IIT-Mandi-or-a-CS-at-the-IIITH",
    "selection2":"If you want IIT tag then go for IIT MANDI CS. But I would suggest you to go for IIITH-CS cuz IIIT were setup for these type of courses and IIIT-H'CS is well known all over the world"
    },
    {
    "name":"How was your IIITH UGEE 2020 interview?",
    "url":"https://www.quora.com/How-was-your-IIITH-UGEE-2020-interview",
    "selection2":"It was pretty decent.Actually I dont know what could happen but in my views they asked me nothing . When the online interview started at first they asked me my name. I told them my name is --------. Then they asked me about my hobbies and interest and why i am intrested in research ? Why I want to join IIIT Hyderabad? All at once I answered them that my hobby is watching youtube videos, I am interested in volunteering and working with Ngo's and I am also interested in opening up electronic items and trying to repair it.Then why research? - I answered them that I want to become a scientist and research allows me to think out of the box and -------xyzabc---------. Then comes the technical part. Que1.The asked me what is arithmetic mean of (x1,x2,x3,x4……..xn) Que2.Then they asked me their geometri"
    },
    {
    "name":"Has anyone qualified for the IIITH UGEE 2018 for the interview?",
    "url":"https://www.quora.com/Has-anyone-qualified-for-the-IIITH-UGEE-2018-for-the-interview",
    "selection2":"At 11pm yesterday, my friend Prathamesh Bonde called me and said that he had been shortlisted for the interview. I was very happy about it, but also a bit sad at the same time because Ii felt that I would not be shortlisted. He checked my results on his phone and … Well Done!! You have been shortlisted for the interview at IIIT Hyderabad. I was very happy on hearing this, but as you know friends (how CRUEL they are :P), so I just confirmed it by asking him to send a screenshot of it. Only then I was satisfied ^-^ Now, Hoping for the best at the interview. All the best to everyone who has cleared it ^_^ Edit : I got 85.5 marks in UGEE. Just got the cut-off by 0.5 marks."
    },
    {
    "name":"Will there be an effect on the cutoff of IIITH because Apple is coming for recruitment?",
    "url":"https://www.quora.com/Will-there-be-an-effect-on-the-cutoff-of-IIITH-because-Apple-is-coming-for-recruitment",
    "selection2":"No. There are many other companies which have a much higher pay than what Apple offered when they visited IIIT Hyderabad. People will rely more on average placement stats of a college as compared to selection of handful students in a particular company. Not sure about iPhone fans out there :P"
    },
    {
    "name":"Now that there are 23 IITs (on paper) in India, is it true that sooner or later, exclusive colleges like BITS Pilani, IIITH will be more valuable? Can the government’s “Education for All” destroy its exclusivity?",
    "url":"https://www.quora.com/Now-that-there-are-23-IITs-on-paper-in-India-is-it-true-that-sooner-or-later-exclusive-colleges-like-BITS-Pilani-IIITH-will-be-more-valuable-Can-the-government%E2%80%99s-%E2%80%9CEducation-for-All%E2%80%9D-destroy-its-exclusivity",
    "selection2":"What’s there in a name? \"A rose by any other name would smell as sweet,\" wrote William Shakespeare in the play Romeo. When you have so many IITs, they would naturally not be able to have the same brand value of IIT. The name of IIT is not going to guarantee quality education. Some IITs would continue to be world class while others would not be even as good as NITs and many Private Engineering Colleges. The most important function for an institute is to provide quality education. This quality comes from three broad factors. 1. The quality of teachers 2. The quality of students 3. The quality of infrastructures The IITs can perhaps have the world class infrastructure as government gives lavish funds to set up an IIT. However, it may be extremely different to get good faculty since all IITs pay the same sal"
    },
    {
    "name":"When are the IIITH UGEE 2018 out?",
    "url":"https://www.quora.com/When-are-the-IIITH-UGEE-2018-out",
    "selection2":"It is out already."
    },
    {
    "name":"How was your IIITH UGEE 2018 interview?",
    "url":"https://www.quora.com/How-was-your-IIITH-UGEE-2018-interview",
    "selection2":"The Interview went very nicely , The Panel was very supportive and the questions they were asking were known by me so I answerd them very confidently. I was so confident on my answers because of IIIT prep as their website IIITprep .com helped me a lot in studies and their PDFs had covered all the necessary topics. You can also download their App IIIT PREP it will guide you with last year papers , UGEE paper analysis etc. Their books IIIT PREP PUBLICATION are one of the best for the study of IIIT Hyderabad."
    },
    {
    "name":"How is the competition in IIITH for lateral entry. How should I prepare for it?",
    "url":"https://www.quora.com/How-is-the-competition-in-IIITH-for-lateral-entry-How-should-I-prepare-for-it",
    "selection2":"People are in general not aware about lateral entry possibility at IIITH. Therefore the competitions is very less as compared to other modes. For example, for 30–40 seats combined in ECE and CSE, we may get 300–400 applicants, but we are able to hardly able to fill half the seats."
    },
    {
    "name":"What would be the difficulty level of IIITH UGEE 2018?",
    "url":"https://www.quora.com/What-would-be-the-difficulty-level-of-IIITH-UGEE-2018",
    "selection2":"To be completely honest, we have no idea how the test is going to be since this is the first time there is only one test for all dual degrees. But the syllabus consists of 11th and 12th grade PCM. So I think it will be something on the pattern of Mains. Have a look at the sample papers too."
    },
    {
    "name":"For ECE, which is a better institute, IIITH or MNNIT? How is the brand name of IIITH in the Indian market?",
    "url":"https://www.quora.com/For-ECE-which-is-a-better-institute-IIITH-or-MNNIT-How-is-the-brand-name-of-IIITH-in-the-Indian-market",
    "selection2":"A2A From both research and placements perspective, clearly IIITH >> MNNIT. Though MNNIT is, in general, a good and reputed institute. For academics, I'm not aware of the systems and resources at MNNIT, so I shouldn't make a comparison. When it comes to industry and academia, IIITH is big brand and its quickly becoming more and more reputed. However, for common people, IIT is still the brand. If you tell some random layman that you are at IIITH, they would likely either - (i) Not recognize the name and think you are in some random institute. or (ii) compare it to Indian Institutes of IT and think you couldn't make it to any NIT or new IIT hence ended up here. Also, you won't get much increase in no. of followers for putting IIITH in your Quora profile, but might go in thousands if it is one le"
    },
    {
    "name":"What is the placement scene at IIITH for MS by Research in CSE?",
    "url":"https://www.quora.com/What-is-the-placement-scene-at-IIITH-for-MS-by-Research-in-CSE",
    "selection2":"Mast scene hai bhai. Samne TCS bhi hai."
    },
    {
    "name":"What's the placements like in IIITH?",
    "url":"https://www.quora.com/Whats-the-placements-like-in-IIITH",
    "selection2":"IIIT Hyderabad has recorded 100% placements year on year with attractive packages. In 2019, a total of 108 companies recruited graduates from IIITH, offering salaries of up to 46 lakhs per annum domestically. Several international firms like Google, Facebook, Uber and Bloomberg also recruited from IIITH, highest package being at 1.5 crore."
    },
    {
    "name":"Does IIITH students get placed abroad?",
    "url":"https://www.quora.com/Does-IIITH-students-get-placed-abroad",
    "selection2":"Yeah IIITH has many alumni placed abroad."
    },
    {
    "name":"What questions are asked in the IIITH interview?",
    "url":"https://www.quora.com/What-questions-are-asked-in-the-IIITH-interview",
    "selection2":"You can look at the following answer Siddharth De's answer to I have been shortlisted for interview at IIIT-H through UGEE. How should I prepare considering its my first off interview?"
    },
    {
    "name":"What are the questions asked in your IIITH UGEE interview?",
    "url":"https://www.quora.com/What-are-the-questions-asked-in-your-IIITH-UGEE-interview",
    "selection2":"The panel ask questions such as Why IIIT ?Why research , they ask question related to your favourite subjects or topics , they ask about your Family, native place, place of study etc. They ask Mathematics and physics related question too. I knew those answers because I had gone through IIIT PREP books the have best source of knowledge for UGEE IIIT and you can prepare for your exams as well as Interview too. Their website iiitprep. Com helps you with PDFs , previous years papers , PAPER PATTERNS etc."
    },
    {
    "name":"Which is the better option, 4 years of CSE at IIITH or at BITS Pilani?",
    "url":"https://www.quora.com/Which-is-the-better-option-4-years-of-CSE-at-IIITH-or-at-BITS-Pilani",
    "selection2":"IIITH has a very good CS course which is on par or maybe better than the ones at old IITs. However the campus social life & extracurricular activities are limited compared to other universities. BITS Pilani is more about all round development of the student with good acads and a plethora of extracurricular activities. IMO you should talk to seniors studying CS at these universities. It will help you to take a final decision."
    },
    {
    "name":"How do I prepare for the IIITH UGEE interview?",
    "url":"https://www.quora.com/How-do-I-prepare-for-the-IIITH-UGEE-interview",
    "selection2":"In your UGEE interview, you will be asked about application of the principles you learned. You will be tested whether you can apply basic topics in daily life. They ask practical questions, like a way to optimise some method, whether that optimisation is feasibly and affordable or not. Also, is there some cheap work around to a method, which uses less resources but gives same result. You will be asked about your preferred topics in the interview. However, you still need to be prepared with the complete JEE syllabus. For example, if you say your favorite topic is gravitation and you explain the solar system to them, they'll ask, what will happen if we replace the planets with charged objects. How will it affect the solar system. For this, you require knowledge of gravitation and electromagne"
    },
    {
    "name":"Why would anyone chose IIIT-H over an IIT?",
    "url":"https://www.quora.com/Why-would-anyone-chose-IIIT-H-over-an-IIT",
    "selection2":"Firstly, whatever I write in this answer is solely my opinion and view. It in no way represents an answer by IIIT-H community or anything of sort. Also, apologies for not so well written answer. Secondly, there are a lot of factors for someone to choose IIIT-H over IIT. Following could be some of many: 1) They didnt get a good rank in IIT-JEE entrance exam, and in turn would prefer to be a CS graduate rather than just doing BTech in any branch. 2) They are really interested in CS and want to take it up as their undergraduate degree, but their JEE rank wasnt good enough to land them into one in any of the top IIT's. The reason I say top IIT's is explained later in the answer. 3) Not such a big factor but sometimes people have location preference or are well aware about CS curriculum here and"
    },
    {
    "name":"What should I know before joining IIITH CSE?",
    "url":"https://www.quora.com/What-should-I-know-before-joining-IIITH-CSE",
    "selection2":"Ok, hold your horses right there. Now that you have made it to IIIT (hearty congratulations since you did), you have a almost a month to yourself. Of course, if you think you want to have an upper hand at programming and you know you have zero experience right now, so if you feel you want to look up something, look up C Programming Basics on the Net. (I know everybody's saying it but still, your choice bro) Once you're in college, this is what you must do. First thing you need is an undeterred focus on lectures. Many people fall asleep during lectures, maybe because the prof. sounds mundane or the course but mostly because of lack of sleep. Second thing you need is continuing to follow-up. Third thing is to keep on practising programming. You will get to know everything eventually. Also, keep"
    },
    {
    "name":"Will I get an admission in IIITH (in any branch) if my Mains mark is 259?",
    "url":"https://www.quora.com/Will-I-get-an-admission-in-IIITH-in-any-branch-if-my-Mains-mark-is-259",
    "selection2":"Yeah , there is a possibility of getting CSE in IIIT-H with 259 score in JEE main score. Incase you are not getting in the middle rounds wait till the last round .Generally the cutoff for CSE ends at 260 or 258 every year. But with 259 score you will definitely get ECE in IIIT-H. Often cutoff for ECE will go near 220. CSE at IIIT-H is dream for many aspirants .I suggest you to opt CSE if you are getting it. ALL THE BEST ! CHEERS !!"
    }
    ]
    }