{
    "selection1": [
        {
            "name": "How has been your IIT B experience?",
            "url": "https://www.quora.com/How-has-been-your-IIT-B-experience",
            "selection2": "hey , I hope you are doing well. I have completed one semester in IIT Bombay so I think i am worth it to answer this question . First of all , I will say i spent best 4 months of my life in IIT. It was an amazing experience to be there . Campus life : Like IITB has one of the best campus among all IITs so I got best campus life there . It was an Autumn semester so I experienced a lot of rain there like it is saying in IITB in rainy season that “you may forget to inhale oxygen once but do not forget having a umbrella while roaming out of hostel..”and it is truth also you can not predict rain there like you see that ohh weather is very pleasant today and you go to washroom for 10 minutes and then you see wtf it’s raining heavily outside .…but it was nice experience there. other than this cats, s"
        },
        {
            "name": "Do students of IITs other than IITB think that IITB students are in general smarter than them?",
            "url": "https://www.quora.com/Do-students-of-IITs-other-than-IITB-think-that-IITB-students-are-in-general-smarter-than-them",
            "selection2": "Before beginning to answer this question, I'd like to state the fact that IIT B was the undergrad college where I wanted to be. Why? It was because most of my close friends would be joining there that was for sure, we had discussions on choosing B or D, and B was the clear winner. Obviously, things don't go the way you want them to be and I eventually joined IT-BHU. During my 4 years in college, I enjoyed a lot, did a lot of stuff, but most importantly, I did realize some important facts about my outstanding batch mates. The only reason why one feels inferior to anybody in general is because of his own insecurities towards his goal in life, i.e. if he has one. Students are lost amongst placements, internships and this myopic view actually restrains a lot of people to look at the broader pict"
        },
        {
            "name": "How should I study if I want to get into IITB CSE?",
            "url": "https://www.quora.com/How-should-I-study-if-I-want-to-get-into-IITB-CSE",
            "selection2": "Dear Anonymous, One line Answer to your question: To becomes as powerful as the sun you need to first burn like it. If you understand what the above line meant you yourself will be able to see what is to be done. Lets go through the statistics top 1–50 ranker (GEN) is able to get IITB CSE. So prepare yourself for a tough time ahead. But as I mentioned above you need to burn yourself in the fire of your desire. Life is like a cafeteria you can order anything, you must willing to pay the cost for it. Now coming to the strategy: 1. Avoid school and get enrolled in a dummy school. 2. Find good teachers doesn’t matter if you join any big coaching or not, as long as your teachers have an experience of teaching for IIT-JEE and you are able to comprehend what they teach all is good. 3. Always keep in mind nobody"
        },
        {
            "name": "What is the procedure for getting a summer internship at the IITB?",
            "url": "https://www.quora.com/What-is-the-procedure-for-getting-a-summer-internship-at-the-IITB",
            "selection2": "The procedure for getting summer internship at different IIT’s may be same. This is why I am going to tell you about my internship. I didn't get the Internship at IITB but I got it from IIT guwahati. There are mainly two ways to apply for internship at IIT :- 1. Regularly check for the Internships at Internships in India | Internshala Search for internship at IIT’s. I got my internship from here only. You have to submit a form and tell them about you area of research and name of prof. under whom you want to work as intern. After successfully submission of the form within few weeks they will call/mail you and ask for your confirmation then list of selected student will be uploaded on their website according to your branch. 2. Search for your area of research and prof. and read his research papers a"
        },
        {
            "name": "What is it like to do aerospace engineering at the IITB?",
            "url": "https://www.quora.com/What-is-it-like-to-do-aerospace-engineering-at-the-IITB",
            "selection2": "Let me give you a brief overview of what is taught in 4 years at IITB. First year is mostly common for all freshers and there is an Intro to Aerospace course in the 2nd sem which is a very basic introductory course (Here's the book we referred to Buy Introduction to Flight Book Online at Low Prices in India ) There are 4 basic divisions where the courses where focused on. Typically, there were 2 courses in each of the below divisions as compulsory courses and you have the option to take electives in your area of interest. Aerodynamics: Study of how plane interacts with the air around, mostly the wing which produces lift. There are also electives available for CFD (computaional fluid dynamics) which is using fluid equations and algorithms to solve the flow Structures: Study of mechanical beha"
        },
        {
            "name": "What are the scopes after studying physics engineering at IIT Bombay?",
            "url": "https://www.quora.com/What-are-the-scopes-after-studying-physics-engineering-at-IIT-Bombay",
            "selection2": "Having done Engineering Physics (EP) from IITB, I guess I am qualified to answer this question. Let me start with explaining what EP comprise. EP is a blend of applied physics courses and electrical courses. They not only teach you quantum computing or Quantum Physics but also many electrical courses. EP is one of the toughest branches at IIT and you will really have to study hard to make it to the top. It is a research oriented branch and is also known as ticket to US. Almost everyone who enrolls for this course gets into top US university to pursue masters/ PhD courses. You can dream to be a scientist/ researcher in academics/ industry. I know many successful professors/ scientists who came from EP. You should only take this branch if you want to pursue research field in physics/ electri"
        },
        {
            "name": "Have anyone seen a leopard in IITB campus?",
            "url": "https://www.quora.com/Have-anyone-seen-a-leopard-in-IITB-campus",
            "selection2": "Well, yes. Today (25th of June, 2017)! A couple of hours ago! It was raining heavily since yesterday night and the sky has been remaining cloudy since the morning. We are in this last Nostalgic days of IITB as our course is coming to an end and thought of going to Sameer hills, just to get some fresh air. Me and my friends (User-13654436720356101577 and Mithilesh Shah) left our hostel (h12) around 11.10 am and walked up to the Sameer hill through the road that starts from Faculty Apartments side. To remind you, this is the least expected season for Leopard sightings in IIT Bombay as the Monsoons are in full swing and it's all lush green. We would have reached the summit around 12 noon, spend some good time over there, clicking pictures and making videos of our beautiful campus. It was misty"
        },
        {
            "name": "What is the one sentence that describes IITB?",
            "url": "https://www.quora.com/What-is-the-one-sentence-that-describes-IITB",
            "selection2": "\"A place to turn your dreams into reality\" A place which is much more than academics- IITB is much more than academics. In fact with time, other activities have surpassed the academics. You want to achieve something? Dream it and work on it here to turn it into reality. You will hardly be judged here by your AIR(All India Rank) or your CPI(Cumulative performance index). Once you get in, your AIR is irrelevant (whether it's AIR 1 or 4 digit rank). Rank 1 becomes as much involved in activities as others and doesn't sound like alien. Each one here has enough potential to achieve anything. You have great resources to support you and great people to guide you(faculty, seniors, and great alumni network). You come with a dream and you have every resources here to fulfill it. I've seen people who we"
        },
        {
            "name": "What is the selection criteria for IEOR IITB? Which one is better IEOR IITB or PDGIE NITIE?",
            "url": "https://www.quora.com/What-is-the-selection-criteria-for-IEOR-IITB-Which-one-is-better-IEOR-IITB-or-PDGIE-NITIE",
            "selection2": "Selection criteria consists of an initial shortlisting based on GATE score, followed by a written test and interview (for 2017 admissions, there was no interview. IEOR at IIT Bombay and PGDIE at NITIE are two entirely different platforms. Though IEOR is not a math heavy department, it is very important to have a strong base in mathematics, linear algebra and probability theory. It focuses more on the technical and modeling aspects. PGDIE, on the other hand, not being an M.Tech program, drives you towards the management side. Both are good. In fact, it depends on your interest as to which side you want your career to be headed onto. Hope that answers your question!"
        },
        {
            "name": "What was the story of your journey to IITB?",
            "url": "https://www.quora.com/What-was-the-story-of-your-journey-to-IITB",
            "selection2": "Pretty interesting actually, mainly because of my school. Firstly, some context here. I came to know of IIT in my 10th, since there was really no culture of IITs in Ahmedabad. No one from my school had cleared it and most of the top guys were only focused on the boards. I didn't prep for IITs in 10th since I was sort of deciding if I really wanted to take up Engineering or Medicine (my parents are doctors). Finally love for Math prevailed and I took up that stream in 11th. Along with that, I also enrolled in a coaching centre. There were only 2 coaching centres in Ahmedabad then (both local) and I had chosen the one with a better hit rate. * And while the ratio of IIT conversions was poor in Ahmedabad, it was poorer in my school. There were hardly a few people who had prepared for it, and only"
        },
        {
            "name": "What do IITB students do to entertain themselves during long hours of study?",
            "url": "https://www.quora.com/What-do-IITB-students-do-to-entertain-themselves-during-long-hours-of-study",
            "selection2": "We come up with innovative ways to keep us out from the abyss of exam blues, it is fondly termed as midsem/endsem lukka. Each time it is something new and innovative, and usually involves face-book. Currently midsems are going on at IITB and this is how my news feed looks like. Look at the hordes of Anu Malik, it started with lot of people changing their fb names to Anu Malik and pretending to be him, but then it suddenly exploded and people changed identities to some or other personality. Here are some more examples from my current news feed, There are babas And foreign nationals This is by no means personal to any celebrity, it is our way to vent out frustration of exams and avoid boredom. This will be forgotten as soon as the midterms get over, then we will see something new come u"
        },
        {
            "name": "What are some of the best dishes to try at food stalls, canteens and messes at IITB?",
            "url": "https://www.quora.com/What-are-some-of-the-best-dishes-to-try-at-food-stalls-canteens-and-messes-at-IITB",
            "selection2": "This answer is going to be edited and added on to whenever something strikes me, so please keep in touch with this answer for all the updates. I shall start with my own hostel's canteen, the famous Hostel 13 Mess-Canteen. Some things you would want to know about the canteen in advance : * Starts at 11 PM and closes at 4 AM. * Maybe the cleanest canteen, also a little cheaper than all others. * Good seating space with water jugs make it even better. Some things you might want to try : * Egg Chilly ( Rs 25 ) : This was something I tried for the first time, and it was worth the 19 year long wait. Boiled egg rolled in flour and fried, is then put in a typical \"chilly\" gravy. Tastes great. * Veg Crispy ( Rs 25 ) : You could call this dish glorified pakodas, but in the last fortnight or so, the staff has chan"
        },
        {
            "name": "Which one is good: IITB or IISc?",
            "url": "https://www.quora.com/Which-one-is-good-IITB-or-IISc",
            "selection2": "It depends on what you want out of your life. IITB is better if you want to become an investment banker and mint money - you get more opportunities to pursue that at IITB. It is also better if you want to become an entrepreneur or build some cool tech. IISc is better if you want to get into serious research, specifically in the pure and applied sciences"
        },
        {
            "name": "How was your SJMSOM IITB interview experience?",
            "url": "https://www.quora.com/How-was-your-SJMSOM-IITB-interview-experience",
            "selection2": "Verdict — Converted GEM ECE Fresher 10/12/Grad/CAT - 94.3/90.3/86.7/98.41 Panel 5 - All male - 2 alumni. 1 professor (SOM). Panel had finance prof. so all candidates were asked a good number of questions related to finance and also economics. IIT-B usually segregates you on the basis of your graduation stream. So, all the candidates in your panel will be from your graduation stream only (ECE grads in my case) Kudos to SJMSOM ADCOM! Using the Gather platform was an amazing experience :) 3rd March, 2021 1pm-6pm ( slot no. 2 ) Actual interview time - 3:00-3:20pm * Introduce yourself - Tell us about your Hobbies and ECs In between I started talking about my family background they cut me in between and said only Hobbies and ECs * What change can be done in examinations for blind so that scribe is not needed"
        },
        {
            "name": "What will be the cutoff marks for IITB in UCEED 2018?",
            "url": "https://www.quora.com/What-will-be-the-cutoff-marks-for-IITB-in-UCEED-2018",
            "selection2": "IDC insider here. I saw Vineet Kapoor's list What that person missed out on was that the number of students who are providing marks this year are more than previous year, approximately 3 times more students have given marks and the number of students appearing was roughly the same (1k+ students added, which doesn't make a different in such an exam) Also,Vineet has used 2,3,5 multipliers. Nice move, but unnecessary at the marks above 170. Just think about it, how could 150 people score 170? That's not how we make an exam. Last year, he used 2x multiplier on the whole list and that was pretty damn accurate, so, no need using different multipliers at different places (only talking about top) when there's only 1 mark difference. That's pretty shitty, I must say, kind of demotivated many students Jus"
        },
        {
            "name": "Why is Christopher Nolan visiting IITB?",
            "url": "https://www.quora.com/Why-is-Christopher-Nolan-visiting-IITB",
            "selection2": "Being situated in the commercial capital of India, IIT-B does attract lots of bigwigs to the campus. The last 2 years that I spent in the campus, I got to see Aamir khan, Ratan Tata, Harsha Bhogle, Arjun Rampal, Lucky Ali etc (I have mentioned only the popular ones, there are many industrialists and intellectuals too who had been to IIT-B) Various people come for various reasons. But Nolan is a different case altogether. He might have been intrigued by India since long and IITB guys would have given him an additional reason to visit India. Anyway, just a couple of months and we all will get too know the reason."
        },
        {
            "name": "What are the most famous dialogues or saying of IITB Faculties?",
            "url": "https://www.quora.com/What-are-the-most-famous-dialogues-or-saying-of-IITB-Faculties",
            "selection2": "This happened just after the end of my mid-semester exams in my first semester in IITB. One of the courses that I had audited was CS725: Foundations of Machine Learning. After a particularly hard mid-semester exam (NOTE: Audit students would not have their papers graded but still had to attend the exam), many people were worried about the beating that their CPI would take. Lots of them started looking at things like the grading statistics, etc. to see how many AAs, ABs, BBs, etc. were given earlier. In the class after the mid-sems, many of them asked for their answer sheets to be graded and returned quickly, so that they could decide whether to continue or drop the course. At that time, the Professor, Sunita Sarawagi assured the class as follows (I’m slightly paraphrasing): Many of you have"
        },
        {
            "name": "What are you studying at IITB?",
            "url": "https://www.quora.com/What-are-you-studying-at-IITB",
            "selection2": "M.Tech. Manufacturing Technology in Mechanical Engineering Department. The reason is very simple: Industries “manufacture”, and they always look out for people with expertise in manufacturing. The subjects taught are down to earth and not abstract. Example- Welding Technology, CAD/CAM/CNC/CASTING/Product design/ Automation, Sheet Metal work and others in this group."
        },
        {
            "name": "What is the average package for electrical engineering at IIT Bombay?",
            "url": "https://www.quora.com/What-is-the-average-package-for-electrical-engineering-at-IIT-Bombay",
            "selection2": "Average package is about 7.5-10 lakhs p.a in the core sector if posting is in India. Average package about 20-22 lakhs if the posting is outside India. Source : Final year student in IITB EE this time. PS: I dont want to run into any trouble with the placement office regarding this so hence the anonymity..."
        },
        {
            "name": "How great is aerospace engineering at IITB?",
            "url": "https://www.quora.com/How-great-is-aerospace-engineering-at-IITB",
            "selection2": "I completed my graduation from IITB - aerospace engineering in 2012. Few of the good professors at that time have retired/retiring. No idea how the new professors are. Visited IITB last year december. The infrastructure has improved a lot - better classroom and labs. It all depends on your focus area within aerospace engineering. IITB is best if you are interested in CFD (computational fluid dynamics) as many professors are involved in this area. It’s good for propulsion and structures too. But if are interested in experimental aerodynamics/fluid dynamics, i would suggest IITK, as there is no experimentalist present in IITB for now (the professor under whom I worked is retiring next year). IITB also has a hypersonic test facility, very few institutes in India have that."
        },
        {
            "name": "How much easy/difficult is branch change at IITB?",
            "url": "https://www.quora.com/How-much-easy-difficult-is-branch-change-at-IITB",
            "selection2": "The difficulty is quite subjective tbh but it is definitely easier than getting a rank under 2K in JEE Advanced. I’ll tell you about my experience of switching from Mechanical to CS at IITB back in 2019. As the quintessential freshmen with the dream of a branch change, I entered IITB. During the orientations I was dumb-founded by the huge pool of extra-curricular activities that IITB offers - from tech teams like IITB Racing to sports to intra & inter hostel activities to cult and tech clubs. Mood Indigo & TechFest orientations literally gave me goosebumps and I was beyond excited! But how would I fit all of these with my academics? The Dean had explained us the 0–1 rule on Day1, “Academics is 1 and whatever else you do is a 0. So make academics your top priority and simultaneously keep add"
        },
        {
            "name": "Which is better for CSE, IIITH or IITB?",
            "url": "https://www.quora.com/Which-is-better-for-CSE-IIITH-or-IITB",
            "selection2": "Coding culture at IIIT-H unparalleled in India. From what I have heard, academically, both institute have different teaching methodology. IITs follow a more generalized approach where you study basics of everything whereas IIIT-H focus on CSE from the get go. GSoC selections, ICPC international ranks speak on their own. IIIT-H CSE placements are on par with old IITs. Having said all this, I would still say that IIT-B is better place. There are things beyond CS studies. IIT is a huge brand name in India and IITs have a reputation outside of India because of their huge alumni network. Whereas IIIT-H is a young institute which is still building it’s alumni network. Being compared with more than half-a-century old institutes as a 2 decade old institute is itself a huge feat. Almost every top r"
        },
        {
            "name": "Which is the best, IITB design or IISc mechanical?",
            "url": "https://www.quora.com/Which-is-the-best-IITB-design-or-IISc-mechanical",
            "selection2": "For which program - Masters or PhD? Both are among the best in the country, but it depends on what you want out of it. For research, it depends a lot on the guide. Overall, I feel IISc has an edge over IITB in research, but the Mech Design group in IITB is larger than that in IISc."
        },
        {
            "name": "Which one should one join for doing an MBA - MDI, NMIMS, SJMSOM (IITB), IIM Shillong, or new IIMs?",
            "url": "https://www.quora.com/Which-one-should-one-join-for-doing-an-MBA-MDI-NMIMS-SJMSOM-IITB-IIM-Shillong-or-new-IIMs",
            "selection2": "I have secured calls from all the above mentioned colleges, and converted in NMIMS. So, I have done some study of the flagship courses of all these colleges till now and will post my opinion based on the study. First things first, MBA is not a rigid course. All of the above colleges offer many elective courses mostly in 2nd year, out of which a student has to choose the subjects based upon his/her area of interest. Most students prefer to specialize in one field such as Marketing, Finance, Operations or HR. So, before deciding upon the college, I believe it is prudent to have a good idea of what each specialisation has to offer to us, and which specialization do we want to pursue. Each college has its own strengths and weaknesses in terms of offering of specialization. I believe this is pro"
        },
        {
            "name": "How is IITK (IIT Kanpur) different from IITB (IIT Bombay)?",
            "url": "https://www.quora.com/How-is-IITK-IIT-Kanpur-different-from-IITB-IIT-Bombay",
            "selection2": "IIT Kanpur was topper's choice much until 2009. IIT B,D,M then took over as metropolitan cities were found more lucrative for internship and job offers. However, IIT K is still best in India because it was built using help from US- and MIT, Stanford (which are undoubtedly the best engineering colleges in the world- and arguably, the best Universities) contributed to its overall structure and function. The only IIT to have its own airstrip, IIT K is way ahead of any other IITs. (Note that MIT, Stanford have been some of the top Engineering colleges in the world for centuries now )"
        },
        {
            "name": "What is the minimum rank required in IIT JEE to get computer science at IITB?",
            "url": "https://www.quora.com/What-is-the-minimum-rank-required-in-IIT-JEE-to-get-computer-science-at-IITB",
            "selection2": "However cutoff on average for CSE AT IIT BOMBAY IS 1–65 for any category … Thank you buddies for 11k+ views hope its useful for you: )"
        },
        {
            "name": "IIT CSE vs IIIT Hyderabad CSE vs NIT CSE?",
            "url": "https://www.quora.com/IIT-CSE-vs-IIIT-Hyderabad-CSE-vs-NIT-CSE",
            "selection2": "Personally I would say that IIIT Hyderabad will be a good choice if and only IF you are interested in coding and computer programming! Here at IIIT-H coding is not a subject, it's the culture. IIIT-H Produces the maximum number of competitors for GSoC every year. In 2014 it was 70 , the highest in the world. Starting from the freshman year, we have a Computer programming course in the first semester, and data structures in the second semester. Both of them are programming heavy courses, where students receive regular assignments, and are required to submit that on an internal online judge (which is pretty much exactly similar to SPOJ / CodeChef / CodeForces in format). Mostly your grades depend on how well you do in these assignments. This gets students started in competitive progra"
        },
        {
            "name": "What are the opportunities for a B.Des student from IITB?",
            "url": "https://www.quora.com/What-are-the-opportunities-for-a-B-Des-student-from-IITB",
            "selection2": "Hi, one of my friends is doing B.Des from UPES- Dehradun and he told me that the career prospects in front of him are as follows: * Transportation Design Studios * Design Consultancy * Accessory Design Studios * Furniture Design * Retail Design * Architectural Design * Electronics Companies for more information, you can visit UPES website or their facebook page."
        },
        {
            "name": "Why did you choose IITB over IISc?",
            "url": "https://www.quora.com/Why-did-you-choose-IITB-over-IISc",
            "selection2": "This is why chose Iitb over iisc. I was fairly good in mathematics in school days. Due to hype of iit in those days( still it is !!) My aim became to get into iit. So started studying for jee in 8th class with some class help. But in 9th -10th ,I got know about Maths Olympiad . As I found interesting problems in maths, I had dream of doing research in basic mathematics.I appeared for INMO exam but couldn't get to camp level. Still I wanted to prepare and appear for Olympiad in 11th -12th and not to do jee preparation.But parents couldn't get it, they wanted me to do jee because I had potential to crack then why not do it. So in college prepared for jee and during it passed kypy . Then wrote the jee and did well. I was confident to get into iitb CS. Due to kvpy , I was invited to IISC orienta"
        },
        {
            "name": "What is the first day feeling of any student who joined IIT Bombay?",
            "url": "https://www.quora.com/What-is-the-first-day-feeling-of-any-student-who-joined-IIT-Bombay",
            "selection2": "Life is great at IITB. Let me elaborate: Hostel rooms suck! unless you are in one of the new hostels. They are on a sharing basis mostly and are unbelievably small. All kinds of exotic insects are present in the old hostels owing to the large number of trees on campus. Cows, dogs and cats are a common occurrence in the hostel corridors. I got up to pee one night and found a cow right outside my door. Holy cow!. Hostels have gyms, ping-pong rooms and common rooms (with a huge LED TV) available for students. Food at IITB hostels is great. IITB has very good systems in place to ensure that the food is decent in quality and of great taste. Hostel and mess council keep a good check and ensure that everything is in place in the mess. In one word: Challenging. Professors expect students to be regu"
        },
        {
            "name": "What one should do to prepare for placement in IITs?",
            "url": "https://www.quora.com/What-one-should-do-to-prepare-for-placement-in-IITs",
            "selection2": "This is specially for software profiles: For coding practice : Develop a habit of regularly solving problems on Hackerrank, Codechef or Codeforces. Each has its own plus and negative points. Choose one which suits you the best. For preparing objective/subjective questions: GeeksforGeeks - This blog is like a bible. It contains questions from interviews (with solutions) , many objective questions topic wise and also notes on many popular algorithms which are frequently asked during placement tests and interviews. Try to go through all the questions atleast once as there are many small mistakes that you will learn from them which you can improve upon later. You should also revise all the Data structures and Algorithms which you had learned in previous sems. Introduction to Algorithms by Thoma"
        },
        {
            "name": "Which is better: IITB or IITD?",
            "url": "https://www.quora.com/Which-is-better-IITB-or-IITD",
            "selection2": "there is very little difference between any of the older IITs, be it Madras, Delhi, Bombay, Kanpur and Kharagpur.. there are differences in specializations, for example one IIT may have better research in Electronics, while another would have better research facility for computer science. So if it is BTech you are going for then choose the location you prefer the most. If it is MTech again go to the location you like the most. And if it is for PhD then go to the college where you find the best professor."
        },
        {
            "name": "What did you take away after completing your degree from IITB?",
            "url": "https://www.quora.com/What-did-you-take-away-after-completing-your-degree-from-IITB",
            "selection2": "I have been thinking of writing about this for a long time now so I will just quickly summarize my takeaways here. Firstly, The Good Things 1. Love for my field: Like textbook, passionate, cannot-live-without-it love. Sure, I feel it every single second that I am not even as good as the average but man this field is awesome. I have a certain respect for the ideologies that are so dominant in the academia as well as the industry; there is this openness and maturity in adapting changes that is just inspiring. The faculty is not only brilliant but also approachable. This are so awesome that you cannot help but be proud that you are in a field that quickly weeds out individual egos. 2. A hobby: I had planned for a million things that I will do when I come to IITB after being in totally cut off from e"
        },
        {
            "name": "Why is Massachusetts Institute of Technology better than IIT Bombay?",
            "url": "https://www.quora.com/Why-is-Massachusetts-Institute-of-Technology-better-than-IIT-Bombay",
            "selection2": "I will give you an answer that is based on a metric that is used to rank universities world over. The answer is based on a premise concerning itself with research. The following answer is regarding the ranking of MIT compared to that of IITB or any IIT for that fact. In my defense, and opinion, I would say that IIT is a school which emphasizes on a stronger skill set among its students. People who graduate from IIT are very skilled engineers and are very good at what they do. However, there is very little research that goes on in IIT, only skill development that has been repeated for every graduating batch. This is the reason why it is not ranked among top institutions, it just does not contribute to the advancement of science. On the other hand MIT is a private research university that has"
        },
        {
            "name": "What is the daily routine of a student in IITB CSE students?",
            "url": "https://www.quora.com/What-is-the-daily-routine-of-a-student-in-IITB-CSE-students",
            "selection2": "I was a student at IITB CSE until some 6 months ago. The daily routine varied a great deal. I will give you a general idea: * First year: There were some 8 - 9 courses per semester (including labs/workshops). The competition was with the entire batch and so, it was relatively easier. Generally speaking, there used to be 4 proper working days in a week. On a working day, we used to have lectures from 2.00 PM - 5.00 PM. On 2 of these working days, there used to be labs/workshops from 9.30 AM - 12.30 PM. So, a total of about 18 hours of lectures/labs. Besides, there used to be tutorial sessions from 2.00 PM - 5.00 PM on Wednesday (it was a non-working day). Overall, the first year was quite chill. You have time to do all of the stuff that you missed out during JEE preparation. * Second year: This"
        },
        {
            "name": "Which laptop should I get for IITB CS?",
            "url": "https://www.quora.com/Which-laptop-should-I-get-for-IITB-CS",
            "selection2": "Update (Jan 2021): I have used this laptop for 4 years now. It’s still working really good and has a better exchange price than laptops bought this year. It’s not as snappy anymore, but the battery life is still holding up to 7–8 hours. It would be a better deal to buy Vivobook/Zenbook/Inspiron series for laptops in this price range today. I am replacing it with the M1 MacBook Air at 83k from the official website using the student discount. It’s a solid laptop with a solid OS, and the new ARM tech is just so fresh that any CS student would like to get his hands on. Go for MacBook Air. (In March 2017) Value price. (can get it for 50,000/-) Really Fast, never Hangs. Fast SSD. ( upto 1GB/s speeds) Classy Design, Very Thin. Light. ( 1.3kg ) MacOS is like Linux. Has Terminal and mostly the same com"
        },
        {
            "name": "What exactly happened in the IITB General Elections 2014? What transpired in the meeting with the DoSA?",
            "url": "https://www.quora.com/What-exactly-happened-in-the-IITB-General-Elections-2014-What-transpired-in-the-meeting-with-the-DoSA",
            "selection2": "The other answers seem to cover the election results well enough, but as the question is also asking about the meeting with the DoSA, here's an account of the days preceding the election: 3 Days Earlier - Caught in H15 Due to the lack of seniors in H15, it was officially banned as a site for campaigning. Freshmen were instead required to attend a separate group campaigning session by each candidate. However, certain seniors were caught campaigning for candidates in H15 soon before the elections (an incident which was recorded and sent to the Dean by a freshman). Rumours were flying of impeachments and DAC's, which I can't comment upon, but I can certainly say that the incident left the Election Committee more than a little ticked off. 2 Days Earlier - The Mail To ensure that no such incident"
        },
        {
            "name": "How is like to study mechanical engineering at IITB?",
            "url": "https://www.quora.com/How-is-like-to-study-mechanical-engineering-at-IITB",
            "selection2": "Basically what defines your resume is what work(projects) you do in your clg while persuing your degree.. Greater the works in your resume greater is your job... u can also go for higher studies"
        },
        {
            "name": "What's the value of an M.Tech from the IITB branch in CSE?",
            "url": "https://www.quora.com/Whats-the-value-of-an-M-Tech-from-the-IITB-branch-in-CSE",
            "selection2": "It really depends. If you are a B.Tech graduate from a prestigeous engineering college or IITs in CS, then its not a valuable cup of tea for you. You should go abroad for higher studies. But if you have a background of other normal engineering college then you can enhance your degree by taking admission in here. * It gives you a bit better placement scenario * It adds a value to your resume with the name of IITB * Better references for higher studies if interested in research work In short it varies from person to person and interest to interest. Aman Goel If you can answer this being a CS graduate from IITB."
        },
        {
            "name": "I will be 28 next year and am planning to go for M.Tech in CSE from IIT, specifically IITK || IITB. Am I too old for this? Will my age be a hindrance when sitting for placements?",
            "url": "https://www.quora.com/I-will-be-28-next-year-and-am-planning-to-go-for-M-Tech-in-CSE-from-IIT-specifically-IITK-IITB-Am-I-too-old-for-this-Will-my-age-be-a-hindrance-when-sitting-for-placements",
            "selection2": "No, placements in IIT for mtech streams doesn't depends on your age factor. I can share with you my experience.. I joined iitb at age of 25. Many of my batch mates where elder than me having age of 29–31. They have 4–5 yrs industry experience too. Something changed with them and pulled them to IIT. Believe me, the way they solve the problem, the way they see the concepts is a lot different from us. So, I will say you have a plus factor of coming for Mtech at IITB. Start preparing for gate. Join some good coaching for GATE as they will help you in brushing your concepts and making yourself punctual for preparation. Placements matter about your problem solving skills. They don't give a shit about your age factor. Hope u find your answer. Thanx for reading :-)"
        },
        {
            "name": "Is IITB worth it?",
            "url": "https://www.quora.com/Is-IITB-worth-it",
            "selection2": "Even though I've completed only one semester at IIT Bombay, I think I can give you a fair answer to this question. At this place, you'll be in company with some of the smartest minds in the country. You'll see people from any branch having crazy skills. You'll hang out with all kinds of people, and learn a lot each and every day. You'll have intellectual discussions once in a while, but those discussions will be intellectually stimulating as hell. The best thing about this place is that you actually gain access to the resources to learn any goddamn thing in the universe, be it learning how to code or learning how to play the guitar. The profs here are okay, some are amazing. The academic facilities too are world class. Ohh and I forgot to mention, sports here are taken very seriously, and yo"
        },
        {
            "name": "How did Aman Goel cope with the fierce competition at IITB?",
            "url": "https://www.quora.com/How-did-Aman-Goel-cope-with-the-fierce-competition-at-IITB",
            "selection2": "First Year: I was quite afraid given that there were many top rankers in my batch who had much better ranks than mine. This fear eventually became a motivation and I studied quite hard. I used to regularly attend all the classes and tutorial sessions. I used to read as well as solve problems from the books like a good engineering kid :P. Fortunately, I ended up with a CPI (GPA) that landed me among the top students in my batch. At the end of first year, I also won Institute Academic Award for being among the top 10 in the institute for the year 2013 - 2014. This helped me a lot in getting my TU Braunschweig Internship. Second Year: During the third semester, I maintained my regular study routine and pattern and was able to retain my position in the batch. However, during my fourth semester"
        },
        {
            "name": "Why, among all IITs, are only IITB and IITK doing well in techfests and culturalfests?",
            "url": "https://www.quora.com/Why-among-all-IITs-are-only-IITB-and-IITK-doing-well-in-techfests-and-culturalfests",
            "selection2": "Techniche,the annual techno-management fest of Indian Institute of Technology, Guwahati (IITG) has been conducting Technothlon, an exam for school kids, since the last 10 years in which more than 2 lakh students participate. Does any other IIT/NIT has such kind of an event? Techniche has also been conducting Guwahati Half Marathon since the last 5 years. The lecture series in Techniche is by far the best in the nation. (Don't believe it? Check this- Techniche '13) Techniche also conducts the only student organised Industrial Conclave,which has amazing series of people from the corporate world. Talking about other events, like robotics, corporate module, predefined, rush hour, funniche, workshop, etc. have received humungous participation every year and add up a good level of novelty each"
        },
        {
            "name": "How did Kalpit Veerwal get IITB CSE with a rank outside the top 60?",
            "url": "https://www.quora.com/How-did-Kalpit-Veerwal-get-IITB-CSE-with-a-rank-outside-the-top-60",
            "selection2": "Reservation 😒 Imagine the pain of the general category students from ranks 61 to 108 who didn't get iit Bombay even after scoring more than kalpit. For whole of their life they will always think that they should have got iit Bombay instead of him. Is it fair? Those students scored more than him but still they are in a lower rank college than him. Changes to be made :- 1- reservation should be removed from the country and increase the reservation for poor people from 10% to 15% they do deserve it. 15% reservation for poor will be much much better than 50% reservation on the basis of caste. 2- admission in top institutes should not only be given on the basis of written exams. There should be other criterias as well. 3- Most of Coaching institutes for jee and medical are not teaching science and m"
        },
        {
            "name": "Which is best for data science, IITB or IISC Bangalore?",
            "url": "https://www.quora.com/Which-is-best-for-data-science-IITB-or-IISC-Bangalore",
            "selection2": "Neither. You can buy any number of degrees and certifications, but none can make you an employable Data Scientist for the industry unless you put 5–7 years of computer programming practice in Python+SQL. Since Indian engineering curriculum is 40 years old and since NO Indian engineering college employs any skilled-employable AI/ML/DS professional, hence NO Indian engineering college produces any skilled-employable AI/ML/DS professional. And, this is the reason that there are no serious core private AI/ML/DS companies in India. It takes about 5+ years of computer programming practice through this way(AI | ML | DS) to become an employable AI/ML/DS professional for the industry."
        },
        {
            "name": "Why is IITB considered the best among all the IITs?",
            "url": "https://www.quora.com/Why-is-IITB-considered-the-best-among-all-the-IITs",
            "selection2": "The quality of an educational institution depends on three important factors. * Quality of Students * Quality of the Faculty * Quality of the infrastructure As far as infrastructure is concerned, I believe that it is same for all IITs. The newer IITs may even have a better infrastructure. However, the other two factors vary drastically among different IITs. In the year 1983, when I qualified for IIT-JEE, IIT Kanpur was the undisputed number one. It remained on the top position for several decades. The main reason was that it was among the newest IITs and set up by USA. It had the best infrastructure and the latest curriculum and model of teaching. IITK also attracted the best faculty because its campus was extremely beautiful and green. It was a self-contained having all facilities for education, sh"
        },
        {
            "name": "What is the highest package of CSE at IITB?",
            "url": "https://www.quora.com/What-is-the-highest-package-of-CSE-at-IITB",
            "selection2": "MICROSOFT is the only company that offers a CTC of 1.3 crores UBER :-99.87 lakhs you can see the below link for more information 1. IIT-Bombay placements: Day 1 sees Microsoft offer Rs 1.39 crore a year, Uber Rs 99.87 lakh 2. https://officechai.com/miscellaneous/iit-bombay-highest-package/"
        },
        {
            "name": "Are Kalpit Veerval and Satvik Ambati classmates in IITB?",
            "url": "https://www.quora.com/Are-Kalpit-Veerval-and-Satvik-Ambati-classmates-in-IITB",
            "selection2": "Yes, they are classmates Not just classmates, they both are backbencher benchmates. I am writing this answer in class while disturbing him in class.."
        }
    ]
}