{
    "selection1":[
    {
    "name":"Which is a better choice, CSE at IIITH or IITH?",
    "url":"https://www.quora.com/Which-is-a-better-choice-CSE-at-IIITH-or-IITH",
    "selection2":"IIITH’s CSE is at par the level of IITB/IITD’s CSE. IITH is also a very good college. If you choose IITH, you will get IIT tag. But IIITH also has its own reputation.One of the top startups in Sillicon Valley, Pocket Gems came to india to hire only IIITH CSE Students. Apple come to India for the recruitment, and they first hired from IIITH. I think you also aware of the fact that IIITH CSE Syllabus is some how better than IITs CSE Syllabus. You don't have to study Science Subjects, mechanics, Engineering Drawing in IIITH. You have to study CSE Subjects from 1st year onwards. Also IIITH’s Coding Culture is famous. Their coding assignment is way more different and difficult than any other engineering colleges in India. Every year they Consistently produce ACM ICPC World Finalists. The select"
    },
    {
    "name":"What is your review of Indian Institute of Technology, Hyderabad (IITH)?",
    "url":"https://www.quora.com/What-is-your-review-of-Indian-Institute-of-Technology-Hyderabad-IITH",
    "selection2":"Let me tell you the real story that goes on behind the closed doors of IIT Hyderabad. Oh yes! i know all the reviews that you would find are positive regarding fractal systems and whatnot. Allow me share with you the actual regime of oppression and repression that goes on which only the people who are studying at IITH know, but do not reveal. It is so frustrating now that the only way to deal with it is to write about it. I will be wholly honest and not sugarcoat anything by playing it up or down. Dont take me wrong, I love my college but this is a reality check. First of all, it is more than 2 hours away from the city and is located near a small village of Kandi. A more appropriate name is IIT Kandi and not IIT hyderabad. This is how it all goes. When we came in the first year, the first s"
    },
    {
    "name":"How is the placement for a mechanical M.Tech in IITH?",
    "url":"https://www.quora.com/How-is-the-placement-for-a-mechanical-M-Tech-in-IITH",
    "selection2":"Poor. Most of such degree holders become clerks in services based companies. Within a month of the admission in such good colleges in India, all the Mtech students(irrespective of the engineering branch they are enrolled into) here understand that if they do not practice computer programming then it shall become uncertain for them to get any job. So, the placement here is good, but only for computer programmers."
    },
    {
    "name":"What are the chances of getting a job at Google after doing an M.Tech (IITs) or MS (IITH)?",
    "url":"https://www.quora.com/What-are-the-chances-of-getting-a-job-at-Google-after-doing-an-M-Tech-IITs-or-MS-IITH",
    "selection2":"Just an additional degree doesn't give you a hi-fi in interview if you are aiming for a job in Google. But, assuming high CGPA along with some publications while pursuing MTech/MS surely gives an added advantage. Many people generally tend to convert to PhD when they are pursuing MS. So, if you are just looking for job, then take MTech (if you really want to make it through\\U0001f609). It not only build up your resume but also make you stand in the front of the line if it is from a good institution(like old IITs, IIT Hyderabad, BITS). So, go join in it now. Now coming to facts, many people gave interviews off campus at Google out of which only 1 was selected (till now as far as I know from IIT Hyderabad) Don't know about old IITs as student number seems to be higher. But even if Google vis"
    },
    {
    "name":"Why is IITH supremely better than IITD?",
    "url":"https://www.quora.com/Why-is-IITH-supremely-better-than-IITD",
    "selection2":"You know the rules and so do i."
    },
    {
    "name":"Is IITH better than IITBHU or IIT Guwahati?",
    "url":"https://www.quora.com/Is-IITH-better-than-IITBHU-or-IIT-Guwahati",
    "selection2":"There are few reasons to choose IITH over IITG and IITBHU. 1. Placements : Place and the research environment in IITH gives students so many opportunities to get the placement. 2. Research: IIT Hyderabad ranked 7th best in India There are so many projects and fields on which IITH students are working on. It won’t be too much if you compare it with top old IITs now. 3. Japan relations/Future opportunities: Not only IITH is getting some funding from Japan Government, Japan also provides so many educational opportunities to the IITH students with attractive internships and scholarships. 4. Student-professor ratio: It is 10:1 here and it is 3rd largest among the IITs. IITGN has 9:1. 5. Courses: IITH senate is so cool. If you have some effective proposal, senate will think upon it and apply it from the next seme"
    },
    {
    "name":"Is IITH good for civil engineering as per placement?",
    "url":"https://www.quora.com/Is-IITH-good-for-civil-engineering-as-per-placement",
    "selection2":"Yes it is good, for 2016 -2020 batch students, IOCL and HPCL DIRECTLY recruited the btech students. With an interview."
    },
    {
    "name":"How good is the biomedical engineering at the IITH?",
    "url":"https://www.quora.com/How-good-is-the-biomedical-engineering-at-the-IITH",
    "selection2":"I am not from IITH but I wanted to answer this just in case you are an aspirant and might make a decision which you might regret. If you are getting another good branch in a good coolege other than IIT's say NIT or DTU etc. then I would say dont run after the college, go for the branch since it would stick with you for a long time. Changing the branch once entered into the college is very tough and needs constant motivation which is hard to sustain. So I wish you luck and hope this would help you."
    },
    {
    "name":"What will be the expected cutoff for artificial intelligence (IITH)?",
    "url":"https://www.quora.com/What-will-be-the-expected-cutoff-for-artificial-intelligence-IITH",
    "selection2":"Hola… Check the below answer which I think answers your ques upto some extent… I gave almost all my views about it in the below answers… By the way remember that AI is not totally new at IITH, we have some well qualified faculty in this field of study…So if you are too passionate about this branch go for it… Surya Prakash Koidala's answer to What will the expected cutoff be of the new AI BTech course that will be starting from 2019 in IITH? Is it advisable to take that course if I get in? Surya Prakash Koidala's answer to How many seats are there in AI BTech at IIT Hyderabad? Surya Prakash Koidala's answer to What 's your view on the AI course offered by IIT Hyderabad, its cutoff, future scope, and course pressure? Hope it helps …. Please upvote and share this answer , so that it reaches many asp"
    },
    {
    "name":"Who are the branch toppers in IITH (batch-wise)?",
    "url":"https://www.quora.com/Who-are-the-branch-toppers-in-IITH-batch-wise",
    "selection2":"abey branch toppers woh bhi batch wise chahiye tumhe ,acads section jakey puchlena"
    },
    {
    "name":"What is the frequency and the timing of buses from Lingampally to IITH?",
    "url":"https://www.quora.com/What-is-the-frequency-and-the-timing-of-buses-from-Lingampally-to-IITH",
    "selection2":"There are no direct buses from lingampally to IITH. First of all you need to reach 'Patancheru' (3 to 5 KM from lingampally). From Patancheru, Bus no. 502 will lead you to IITH... Mostly for every half an hour, there is a bus...."
    },
    {
    "name":"Is it worth it to do an M.Tech in IITH for ECE?",
    "url":"https://www.quora.com/Is-it-worth-it-to-do-an-M-Tech-in-IITH-for-ECE",
    "selection2":"IIT-H is probably the fastest growing IIT in one of the biggest industrial cities of India.It is having perks such as locational advantage, better connectivity, industry and experts interactions etc. IIT-H rises in recent few years because of its new and strong academics schedule. Due to its amazing academics, IITH was able to get 7th rank among all IITs. Also,department of electrical (including Mtech in VLSI) have modern labs and strong collaborations. Labs of VLSI and microelectronics are well equipped. According to sources, last year 90–95% placement recorded and the too in core Electronics industry. But,I would suggest you to go there and talk to people before taking any kine of decision. After all you will be there for 2 years if chosen for the program and might even continue for few mor"
    },
    {
    "name":"Who is the best professor at IITH?",
    "url":"https://www.quora.com/Who-is-the-best-professor-at-IITH",
    "selection2":"If after the class most of the students feel that they learned something new today, or if they are discussing subject problems till they reach their hostel rooms or depart, and the subject problems doesn’t leave their minds till they solve them, then that’s the professor’s class to whom I would say best professor. We have a faculty, Dr. Sumohana Channappayya, who taught us Signals and Systems. In the class most of the students are final year BTech Students or first year MTech students or PhD students, who just cleared the GATE exam and have their concepts sharp and clear. With this background of students, if you are revising some subject and still students feel so much interested in the subject, then you are the one who we are searching. Professor Sumohana started the subject from the basics"
    },
    {
    "name":"Which is better IITH CSE or IIT BHU CSE?",
    "url":"https://www.quora.com/Which-is-better-IITH-CSE-or-IIT-BHU-CSE",
    "selection2":"I am answering it considering that package is the first priority. Without any doubt, go join IIT-BHU. Most of the people who take up CSE don’t know much of programming to start with. So you should not worry about that as during the course of study you will become sufficiently qualified to get into all the well paying companies."
    },
    {
    "name":"IITG or IITH, In the year 2020 which one should we opt for M.Tech. in CSE?",
    "url":"https://www.quora.com/IITG-or-IITH-In-the-year-2020-which-one-should-we-opt-for-M-Tech-in-CSE",
    "selection2":"IITH. Reasons are as follows: 1. IITH has better NIRF ranking than IITG. 2. IITH placements in CSE are one of the best in the country. Average placement package is Rs. 16–17 lakhs per annum."
    },
    {
    "name":"What are the course details of a BDES in IITH?",
    "url":"https://www.quora.com/What-are-the-course-details-of-a-BDES-in-IITH",
    "selection2":"The Department of Design at IIT-Hyderabad offers a vibrant environment for learning, practicing and exploring several facets of design. The department envisions to creatively engage in the space between technologies and people.This involves facilitating innovation in the key emergent areas such as Participatory and collaborative Design, Professional Ethics/ Sustainability, Product Systems and Services, Design and education, Wellness, Crowd sourced Design."
    },
    {
    "name":"Why do electrical proffessors at IITH give less grades to 70% of the class?",
    "url":"https://www.quora.com/Why-do-electrical-proffessors-at-IITH-give-less-grades-to-70-of-the-class",
    "selection2":"I don't understand why you had to ask this anonymously. But since you asked, here are some questions on which you should work out. 1. How many students of your batch put their maximum effort throughout the course? ( Do assignments on their own, read additional reading materials provided, practice problem sets regularly, read related papers etc) 2. How many attend classes regularly ? Out of those who attend classes, how many of them actually listen to the class and interact with professor? 3. How many students of your batch score good marks that can fetch them good grades. Well, I asked these questions to myself and here are some observations 1. Hardly 50% of the students put their maximum efforts throughout the course. These guys just do the assignments on their own, others either copy from t"
    },
    {
    "name":"Which is best, BITS Pilani CSE or IIITH CSE?",
    "url":"https://www.quora.com/Which-is-best-BITS-Pilani-CSE-or-IIITH-CSE",
    "selection2":"No one can answer this question unbaisedly if they haven’t experienced both of them. One must compare two things only after knowing a great detail out of it. Clearly no one would have experienced both the Colleges. Though one may be better then the other in some aspects but may not be better in other aspects What I know is, at the end of the day this difference doesn’t matter more then your knowledge. Did your 10th grade marks make a difference in your college admission? Generally it doesn’t ( 99.9% , we have to cinsider exceptions everywhere :P ) . if you feel that you can bag a better package from one university you are wrong. A company often gives the same package for all the same positions it has to offer , irrespective of the Campus or College it is going. SO there goes strike 1. Peopl"
    },
    {
    "name":"How is a B.Des. at IITH?",
    "url":"https://www.quora.com/How-is-a-B-Des-at-IITH",
    "selection2":"IITH will be one of the new IITs starting a new design program. IITs have not been known for design program. IIT Delhi is not known for design even after 25 years of constantly running an MDes program. I would have serious doubts about its BDes program of IITH"
    },
    {
    "name":"How is IITH?",
    "url":"https://www.quora.com/How-is-IITH",
    "selection2":"IIT Hyderabad RANKING International In QS BRICS University Rankings of 2018 : 100 National By NIRF in 2019 : 8 By NIRF in 2018 : 9 By NIRF in 2017 : 10 By The Week in 2015 : 22 By Edu Rand in 2015 : 17 Placement 2018 HIGHEST PACKAGE OFFERED Rs 40 lakh per annum AVG PACKAGE OFFERED Rs 11.5 lakh per annum 2019 HIGHEST PACKAGE OFFERED Rs 53.79 lakh per Annum AVG PACKAGE OFFERED Rs 18.00 lakh per Annum Overall A very good engineering college"
    },
    {
    "name":"Which college is better, IIITH or IITH?",
    "url":"https://www.quora.com/Which-college-is-better-IIITH-or-IITH",
    "selection2":"In my point of view IITH is better than IIITH. In IIT H campus life, fest, sport, etc. are excellent things, and got IIT tag from IIT H, in every field IIT tag matters like a promotion in the company and something at all but IIIT H is also a good institute for information technology. In the case of IIITH CSE or IIT H CSE, I think both are equal, but IIT will more opportunities for you. IIT Hyderabad campus IIIT Hyderabad campus: Hope this information helps you to get into IIT H and IIIT H. If you like this please upvote. 🙏"
    },
    {
    "name":"How is IIT Hyderabad? Is there a permanent campus for IITH?",
    "url":"https://www.quora.com/How-is-IIT-Hyderabad-Is-there-a-permanent-campus-for-IITH",
    "selection2":"Construction is going on..various foreign architects have planned it.. Well not yet completed.."
    },
    {
    "name":"Which should I choose for mechanical engineering - the IITH or BITS Pilani?",
    "url":"https://www.quora.com/Which-should-I-choose-for-mechanical-engineering-the-IITH-or-BITS-Pilani",
    "selection2":"I will give my opinion solely based on my experience after completing my B. Tech from Delhi College of Engineering. (I’ve made it to IIT-JEE (2011) Extended Merit List & AIEEE (2011) 1216 as All India Rank). I’ve worked as Mechanical Engineer in the industry for 2 years. My very simple & straight advice to you is: You should join IIT-H. Now, let me quote some points: * BITS Pilani is definitely a better college than IIT-H as of now, because BITS Pilani is well established, has quality infrastructure & faculty, & more importantly a wider Alumni base. * But Still, I want you to join IIT-H, Why? * * In Industry, IIT tag matters! There are some specific job websites that will only permit those who have IIT/IIM tag with them. (No Matter, which IIT it is, IIT Jhumritalaiya or IIT Delhi. * * While applying to some"
    },
    {
    "name":"Why is Japan investing so much at IITH?",
    "url":"https://www.quora.com/Why-is-Japan-investing-so-much-at-IITH",
    "selection2":"Indian Institute of Technology, Hyderabad (IITH) is fast making Japan a favourite destination for its students. The institute has a collaboration with the Japan International Cooperation Agency (JICA) and under the JICA-Friendship project, aims to enhance and broaden the scope of education and research. IITH expects the Japanese expertise will help its students work in advanced laboratories in Japan and thereafter get jobs in Japanese companies. \"Japanese companies are keen on hiring Indian students. Working in collaboration with the universities there increases students' chances for landing a good placement at these companies,\" says IITH Dean, Academics, Prof Faiz Ahmed Khan. There are over 1,200 Japanese companies in India as of October, 2014, in the areas of automobiles, electronics and h"
    },
    {
    "name":"What is the placement scenario for an M.Tech in biomedical at IITH?",
    "url":"https://www.quora.com/What-is-the-placement-scenario-for-an-M-Tech-in-biomedical-at-IITH",
    "selection2":"M.Tech students from branches like Chemical, Civil, Biotech and Biomedical from IITH struggle a lot to get placed! Biomedical and Biotech students generally opt for Ph.D after their M.Tech."
    },
    {
    "name":"Which IIT is better for an MSc in chemistry, IITH or IITG?",
    "url":"https://www.quora.com/Which-IIT-is-better-for-an-MSc-in-chemistry-IITH-or-IITG",
    "selection2":"As per me IITG BUT you have to take decision yourself only"
    },
    {
    "name":"Is IITH Hyderabad a private college?",
    "url":"https://www.quora.com/Is-IITH-Hyderabad-a-private-college",
    "selection2":"Hari om , you are asking a auestion as to : “Is IITH Hyderabad a private college?.” IIT Hyderabad is a Govt autonomous institute. I am not aware of what is IITH Hyderabad?. Hari om."
    },
    {
    "name":"What is better in terms of placement, IITH or BITS Hyderabad?",
    "url":"https://www.quora.com/What-is-better-in-terms-of-placement-IITH-or-BITS-Hyderabad",
    "selection2":"You cannot genelise placement. CSE in both the institute have an annual average of over 15 lakh always . So does electrical and electronics . But IIT Hyderabad is a great IIT , still a new IIT but it has already come at par with top institution of India. Plus the honourable tag of IIT. They all just boost your placement. But IIT Hyderabad has better minors plan which will help you to get knowledge in not just one but multiple fields. That increases your placement chances. So look accordingly I recommend IIT Hyderabad. Hope this helps."
    },
    {
    "name":"Should I opt for Mech at IITH or CSE at ISM Dhanbad?",
    "url":"https://www.quora.com/Should-I-opt-for-Mech-at-IITH-or-CSE-at-ISM-Dhanbad",
    "selection2":"Thanks for A2A ! Firstly heartly congratulations for qualifying JEE (Advance). Well, I would present before you the various aspects of my analysis, perception & arguments for the above mentioned colleges and streams. However, the final choice is always yours. IIT Dhanbad V/s IIT Hyderabad: Being graduated from IIT Dhanbad, I am very much aware about its faculties, departments and rich ambiences. However, without being biased toward it I would share my honest opinion. IITH in comparison to IIT DHN, no doubt, is better geographically located, better NIRF ranking encompassing many criteria of evaluation, better infrastructures and better integration to modern Metro life and habitation. I believe the faculties of IITH and IITDHN are more or less would be on the same footing, may be slightly bett"
    },
    {
    "name":"Can I apply for UGEE as well as JEE Mains for admission in IIITH?",
    "url":"https://www.quora.com/Can-I-apply-for-UGEE-as-well-as-JEE-Mains-for-admission-in-IIITH",
    "selection2":"Yes you can apply for both the exams but the purpose of the two exams is different. UGEE is for admission into 5 years Btech+MS program of IIIT Hyderabad only. Through JEE mains you can get into 4years BTech program only."
    },
    {
    "name":"Which is better, mechanical at IITH or chemistry at IITM?",
    "url":"https://www.quora.com/Which-is-better-mechanical-at-IITH-or-chemistry-at-IITM",
    "selection2":"It depends on your interest whether you are interested in technical or have interest in chem, whether you wanna do higher studies (suggested chem at IITM) or job (suggested mech at IITH)."
    },
    {
    "name":"Is IITH a ragging free campus?",
    "url":"https://www.quora.com/Is-IITH-a-ragging-free-campus",
    "selection2":"Yeah.In IITH , there is zero tolerance of ragging and anti-ragging community is also there to eradicate the social harasshment among people."
    },
    {
    "name":"Which branch at IITH is newly introduced?",
    "url":"https://www.quora.com/Which-branch-at-IITH-is-newly-introduced",
    "selection2":"For M.tech i can tell you 1.network and information security and 2.smart mobility are branches that are introduced in 2020 both branches are similar to cse except 1-2 subjects.(maybe few more may add i'm from cse background so i know about these two only😅)you can check the official website for more information."
    },
    {
    "name":"What will the expected cutoff be of the new AI BTech course that will be starting from 2019 in IITH? Is it advisable to take that course if I get in?",
    "url":"https://www.quora.com/What-will-the-expected-cutoff-be-of-the-new-AI-BTech-course-that-will-be-starting-from-2019-in-IITH-Is-it-advisable-to-take-that-course-if-I-get-in",
    "selection2":"Hi.. As you might be knowing that IITH is the first institute in India to introduce a new BTech program on AI engineering. Though the seats are very limited and the name AI is having such a demand now a days, the cutoff rank for it will be competing with that of CSE of IITH and other old IITs. My view upon the branch is that it will be having some awesome faculty . Firstly we at IITH are having some really good profs in this field . I have taken a course “Intro to AI and ML” in this sem .The course provided us a quick start to understand what AI is all about. It was really awesome. So if you are truly intrested in pursuing a degree in AI , there's no other fantastic place other an IITH… FEEL FREE TO UPVOTE , So that many aspirants will be knowing about the new branch…"
    }
    ]
    }