{
    "selection1": [
        {
            "name": "What is the best way to keep monkeys away from your wing in an IITM hostel?",
            "url": "https://www.quora.com/What-is-the-best-way-to-keep-monkeys-away-from-your-wing-in-an-IITM-hostel",
            "selection2": "This answer is not really about keeping monkeys away from your wing, but about how to deal with them if you ever find them around you. In my first week at IITM, I walked into my room one day to find the place a mess and all the food I'd brought from home thrown about. After initially thinking that this was some weird form of ragging, I noticed the open mosquito nets on the windows. Thus began about two long years of monkey-trouble. I never brought food to the room again, but I lost many a biscuit-packet/juice-bottle/ice-cream to the monkeys prowling outside Campus Cafe/EE dept. coffee shop/Gurunath. I wanted to put an end to all of this, but I didn't know how. This was around the time when I was reading Life of Pi too, and I read with particular interest how a ringmaster convinced his lion"
        },
        {
            "name": "What are some of the most iconic pictures of IIT Madras?",
            "url": "https://www.quora.com/What-are-some-of-the-most-iconic-pictures-of-IIT-Madras",
            "selection2": "Here are few images that I borrowed from http://lms.ptudep.org/templates/default/images/tests_cloaked/GOIIT/IIT%20Madras/big%20images/ (all thanks and credits to the one who has hosted these files on the web). Not necessarily iconic, but sums up a lot of memories for sure: Gajendra Circle Hostel quadrangle Admin block CLT Central workshop entrance CSC (Computer science center) HSB - Humanities & Sciences block MSB - Mechanical Sciences Block ESB - Electrical Sciences Block Central Library Gurunath Deer OAT Lake The new hostels IIT-M Main gate Taramani gate Velachery gate Roads The bus (battery-powered) All-night Quizzing competition JAM Rock competition Fitness Center Football ground Campus Cafe Himalaya Mess The mess that rain can leave behind"
        },
        {
            "name": "Why does Taramani guest house at IITM still not allow opposite-sex guests? Are we living in stone age?",
            "url": "https://www.quora.com/Why-does-Taramani-guest-house-at-IITM-still-not-allow-opposite-sex-guests-Are-we-living-in-stone-age",
            "selection2": "LOL! An A2A for this? Anyway here goes... To answer the questions in that order, 1. Because the administration wants to stay clear of (and maybe is rightly afraid of) controversies/complications that might arise in the absence of the rule. 2. No. \"Any publicity is good\" does not hold for educational institutions like IITM Let us look at the issue from IITM admin perspective. Our society, even now, by and large, consists of parents and families where a boy having a girlfriend isn't taken well and a girl having a boyfriend is 'shameful'. Now consider the reaction of the same society when they find their sons and daughters sexually active! We might argue, IITM should champion modern values, it is a world-class institution et cetra. Firstly, not everyone would agree that these \"modern values\" are de"
        },
        {
            "name": "What can be improved or changed for the better at IIT Madras?",
            "url": "https://www.quora.com/What-can-be-improved-or-changed-for-the-better-at-IIT-Madras",
            "selection2": "Well,lets first start with the students and then go to the system;because we cant criticise the system without changing ourselves. Students: 1.All students with a good CG are called muggus.I agree that muggus are there.But there is one more class of students who constantly raises questions over taught content,tries to come up with innovative methods and has knowledge,not temporary memory.Distinguish between permanent knowledge and temporary memory.Call the latter as muggus;but not the former.Its the former that will make India a better place. System: 1.Industrial visits to industries of the respective branches in the first year itself.This promise is made every year but it never materialises. 2.Workshops and Labs:Workshops and Labs are no doubt a vast treasure of practical knowledge.Howeve"
        },
        {
            "name": "How good or bad is an MS in aerospace engineering at IITM?",
            "url": "https://www.quora.com/How-good-or-bad-is-an-MS-in-aerospace-engineering-at-IITM",
            "selection2": "MS in Aerospace Engineering at IIT Madras is not bad. Or maybe it is bad if u r not able to complete it. Or if u take more than 3–4 years to complete. However, if your project needed lots of hits and trails, and experimenting again and again to arrive at the correct solution, maybe it is still worth it. Now the good about a MS degree in Aerospace Engineering from IIT Madras is that it is the best degree u can get in India. U can continue at IITM or some other Institute in India or abroad, for your Ph.D program."
        },
        {
            "name": "Which institute is better for an M.Tech CSE: IITB, IITD, IITK, IITM or IISc?",
            "url": "https://www.quora.com/Which-institute-is-better-for-an-M-Tech-CSE-IITB-IITD-IITK-IITM-or-IISc",
            "selection2": "This post is specific to IITB vs IISc but you can similarly have a thought process for the other institutes. IISc vs IITB: debunking the myths + detailed analysis of Computer Science research (and placements). This can be used decide how to select colleges as well. It is a 20 min read but hopefully debunks the 4 myths which I think are of pressing concern and hopefully helps aspirants to make an informed decision. I have tried to be as unbiased and rational as possible and tried to highlight the pros and cons of both colleges and have spoken to a lot of people from both IISc and IITB to get to these conclusions. The 4 Myths: Fallacy 1: “Placement chahiye toh IITB jao, IISc nahi!”, “IISc main placements nahi hote. Sab gareeb log hain.” (IITB is the best for placements whereas IISc is not.) Falla"
        },
        {
            "name": "Who are the studdest junta to have graduated from IITM in the last 5 years (2008-12)? What did they do in insti and where are they now?",
            "url": "https://www.quora.com/Who-are-the-studdest-junta-to-have-graduated-from-IITM-in-the-last-5-years-2008-12-What-did-they-do-in-insti-and-where-are-they-now",
            "selection2": "Thanks for the A2A Anon! This is actually a very ambiguous question to answer since the people we are going to talk about are recent alumni, and their contributions to the world will probably take more time, or it may also be that their works are in the process of coming out big. I've had the good fortune of interacting with some really good people in the last five years at IIT Madras, and in this answer, I have used what they did at IIT Madras as the main metric to answer this question. The studdest in my opinion was the late Ayush Joshi from the Batch of 2010. He as a mechanical dual degree student, and was one of those who was good at whatever he did. He was a nine-pointer (I think he dropped to just below 9 before passing out), he was a Shaastra core, he was the institute cricket captain"
        },
        {
            "name": "What is the gate rank required for VLSI in IITM?",
            "url": "https://www.quora.com/What-is-the-gate-rank-required-for-VLSI-in-IITM",
            "selection2": "Would be safe if you have a rank around 150–200.( considering you’re from General category). There are other courses like some industry sponsored M. Tech course where the rank can go a little bit high but there are a lot of another factors involved too like written tests and interviews."
        },
        {
            "name": "Who is the best all-rounder of IITM in terms of acads, tech, sports, cult etc.?",
            "url": "https://www.quora.com/Who-is-the-best-all-rounder-of-IITM-in-terms-of-acads-tech-sports-cult-etc",
            "selection2": "I would say it would be either Akshay Rangamani or Chandrashekhar Nagarajan. Both of them belong to the IITM batch of 2009. Brief background about both of them Akshay Rangamani (Pillsburry / Rangooski) This guy was AIR 89, wanted to be do BioTech but ended up in Electrical Engineering. In his four years he would have done it all. He represented IITM in iGem in his first two years. Did internship in Germany. Did innumerable projects both within and outside institute. Ended up getting a couple of patents. He ended his undergraduate days with some 9+ GPA and was awarded Institute Blues Silver. Apart from acads he is a classically trained carnatic singer. He was guy around whom IITM's quizzing team revolved in his four years. He was coordinator for a host of events in Shaastra and Saarang and was"
        },
        {
            "name": "Which is better, IITM or IIT Delhi?",
            "url": "https://www.quora.com/Which-is-better-IITM-or-IIT-Delhi",
            "selection2": "Well, I don't know much about IIT Delhi, but being a student at IITM, I must say IIT Madras is the best. Period. Here’s why. Ranked #1 Engineering College by NIRF twice in a row, this year and last year. Awesome Campus. It is one of the best campuses in India. The campus is a lush green forest of 620 acres, home to blackbucks, deers, monkeys and even jackals. It is practically living in a forest situated in the city. There’s even Phoenix Market City just 1 km from the campus if you ever get bored. IIT Madras Research Park, first of its kind in India. It nurtures startups through incubation efforts and technical infrastructure. This is the primary reason for the numerous startups at IIT Madras. It even has corporate clients such as Bharat Heavy Electricals, Saint-Gobain, Forbes Marshall, Ather"
        },
        {
            "name": "What is the procedure to get an internship in iitm?",
            "url": "https://www.quora.com/What-is-the-procedure-to-get-an-internship-in-iitm",
            "selection2": "There are two ways to get an internship at IIT Madras. 1. Every year IITM calls applicants for summer fellowship programme by offering 2 month paid internship in their labs for all departments. This year, the application deadline for the same is 28th February (link to the website). 2. The second way is to go to the respective department website of IITM and look at the faculty member profiles. You can pick professors who work in research areas which are of interest to you and personally drop them an e-mail requesting for appointment or for opportunities to work with them in small projects and express your hunger to learn lots in the respective project or area, requesting for guidance. In most of the cases, they will be very kind enough to provide you with some projects and they can take you as int"
        },
        {
            "name": "How is the IITM Janakpuri College of IP University for a BCA?",
            "url": "https://www.quora.com/How-is-the-IITM-Janakpuri-College-of-IP-University-for-a-BCA",
            "selection2": "IItm janakpuri college is the top college for BCA in IP university. 2012- 15 Batch Gold medalist is from IITM janakpuri . Placements are excellent in organisations like TCS, WIPRO, Deloitte etc. Giving to your message yes, they keep us in class because the teacher want us to do well in life.The placements are totally dependent on the performance of students."
        },
        {
            "name": "Government rankings (India) 2016: What's your say on IITM being declared as the best Engineering college and IIMB as the best Management institute?",
            "url": "https://www.quora.com/Government-rankings-India-2016-Whats-your-say-on-IITM-being-declared-as-the-best-Engineering-college-and-IIMB-as-the-best-Management-institute",
            "selection2": "Following are the parameters against which engineering colleges were weighted for this ranking (Source : MHRD, National Institute Ranking Framework (NIRF)) - Engineering (Research & Teaching) Teaching, Learning & Resources(Ranking Weightage = 0.30) These parameters are related to the core activities of any place of learning. These lay emphasis on measuring numbers and quality of faculty, library and lab resources and general facilities for development of young persons. These are organized into the following sub-parameters: * Faculty-Student Ratio with Emphasis on Permanent Faculty (FSR) [30 Marks] * Combined Metric for Faculty with Ph.D and Experience (FQE) [30 Marks] * Metric for Library and Laboratory Facilities (LL) [30 Marks] * Metric for Sports and Extra-Curricular Facilities, Activities (SEC) [10"
        },
        {
            "name": "How is the course PGPX VLM from IIMC, IITM, IITK?",
            "url": "https://www.quora.com/How-is-the-course-PGPX-VLM-from-IIMC-IITM-IITK",
            "selection2": "Indian Institute of Management, Calcutta (IIM Calcutta) is offering a unique one-year residential programme called the Post Graduate Programme for Executives for Visionary Leadership in Manufacturing (PGPEX-VLM), conducted jointly with IIT Kanpur and IIT Madras. This programme has been designed in close consultation with industry groups such as the Confederation of Indian Industry (CII), Japan International Cooperation Agency (JICA), and Government of India. IIM Calcutta’s PGPEX VLM is the best platform to accelerate the career of mid-level professionals in manufacturing domain. Its course structure focused on techno-managerial subjects is ideally suited to the needs of a working engineer to surge in career. Unlike other management programmes, the VLM offers courses in high-end technologi"
        },
        {
            "name": "What is it like doing a PhD in IITM?",
            "url": "https://www.quora.com/What-is-it-like-doing-a-PhD-in-IITM",
            "selection2": "Well, To be honest, PhD anywhere is a matter of choice. I would advise you not to take up PhD if you don’t have the sufficient drive to do it. Assuming you are extremely interested in doing a PhD program, IIT Madras is a good place to do so. In my department (Chemical Engineering), both the department and the faculty are really friendly. You get to learn a lot of things everyday and ultimately you will be satisfied with what you are doing. TA ships will help you if you wish to become an instructor. Working hours are usually flexible pulling you more closer to the comfort zone, but again, make sure not to get too much into the comfort zone. Geographically the institute lies in the heart of the city making it easier to go around in leisure times. In a nutshell, if you have the sufficient hunger"
        },
        {
            "name": "Is IITM Janakpuri good for a B.Tech?",
            "url": "https://www.quora.com/Is-IITM-Janakpuri-good-for-a-B-Tech",
            "selection2": "IITM-Indraprastha Janakpuri is not affiliated to any university to offer B.Tech degree. You can check the website of college to get more clarity on this. The B.Tech they are offering is based on tie-up with colleges of Haryana which are affiliated to some state run university of Haryana. Students are enrolled in colleges of Haryana and get classes at IITM-Indraprastha. For examinations students go to respective centers in Haryana. It's a sort of fraud going on."
        },
        {
            "name": "What are the IITM accommodations/hostels and food like?",
            "url": "https://www.quora.com/What-are-the-IITM-accommodations-hostels-and-food-like",
            "selection2": "It's extremely good .Infact I recommend you to make it as your sole objective of cracking JEE. If I had known earlier that such fantastic delicacies were going to be served at IIT , I would have doubled my effort while preparing. Food is awesome at IIT. I have never tasted such good food in my entire life. I have put forward the proposal fo..."
        },
        {
            "name": "What is the minimum Percentile and Rank I need to get in GATE for Joining IITM - MTech CS?",
            "url": "https://www.quora.com/What-is-the-minimum-Percentile-and-Rank-I-need-to-get-in-GATE-for-Joining-IITM-MTech-CS",
            "selection2": "Forget about the percentile. That is irrelevant and just earns you bragging rights in front of your CAT aspiring friends. Only the rank matters for IIT admissions. Mere 2 digits after decimal point is not precise enough at the scale of GATE to determine your insti. To get a confirmed seat in IITM M.Tech CS, if you belong to general category you need to be under 120 in GATE 2013. In 2011, I was rank 175 and I got it. Back then, last rank admitted was 195(or something close to 200) in general category. In my junior batch i.e. people who wrote GATE 2012, last rank admitted was 144 in General(or something close to 150). This year it is expected that the last admit rank will plunge down further because of excellent placements M.Tech CS batch has been enjoying during past few years here."
        },
        {
            "name": "What is spot admission in IITM for a M.Tech admission through gate?",
            "url": "https://www.quora.com/What-is-spot-admission-in-IITM-for-a-M-Tech-admission-through-gate",
            "selection2": "Once you fill the iit Madras form .. After finishing regular rounds if u r not alloted with any department then automatically you will be considered for spot round. Spot round is same as regular round, you need not to be @ iitm physically as you have to be present @ iit bombay. Online you will get to know wether you got spot admission or not. If u r selected in any department (depending on ur preference and gate rank) you will receive mail from iitm. Only difference in spot and regular round is that you will get half day to decide whether you want to join or not. If you want to join, then you have to pay college fees online along with that you have to send soft copies of two or three documents (which will be attached with the mail) on the same day when you get offer letter. If in regular r"
        },
        {
            "name": "How was cheating enabled by IITM?",
            "url": "https://www.quora.com/How-was-cheating-enabled-by-IITM",
            "selection2": "There was no cheating enabled.Just the paper was easy.Every one wrote it well.Coming to bonus marks +11 was awarded for every one who attempted jee advance and +7 was given for two questions with multiple possible answers.Jee Mains the math paper was lengthy and cut off got down No one poked jee mains But as advance cut off goes high every one comments.I heard lot of people saying they attempted the questions of ambiguity for long time.But if u were too clever enough u could have known it.Its just to make an argument Some people bring that point.Coming to predicted ranks “These rank predictors are just set up one day after jee advance I cant understand How could they predict a pattern for 200000 students and predict their results.They just take the previous years rank analysis and upload"
        },
        {
            "name": "Are there any horror stories in IITM?",
            "url": "https://www.quora.com/Are-there-any-horror-stories-in-IITM",
            "selection2": "The following incident happened in Narmada hostel when I was a fresher in IITM. (Names changed to make things anonymous and conceal the identities). During my fresher year, two other freshers X and Y were allotted a shared single room.Y along with his friends started creating rumour stories about the room to X claiming that the previous occupant of the room committed suicide by hanging in that very fan in their room and also mentioned that few people in this hostel have seen likely ghosts walking around in the hostel.X didn't believe that story at that instant and thought that these people where kidding with him. In the following nights, his friends took a stick tied to a long rope and tried to bang the window of that particular room from the terrace in the middle of the night to create a \""
        },
        {
            "name": "Is IITM college of IP University good for a BCA?",
            "url": "https://www.quora.com/Is-IITM-college-of-IP-University-good-for-a-BCA",
            "selection2": "Well iam a bca student in iitm. The choice of entering into this college is really based on the fact of what a student wants i.e if you really want to study hard and slog for a better future iitm is the best place. Because here there is no so called “masti” entertained. This college purely seeks for a strict academic behaviour.And in my view if you have thought of taking bca then obviously you must be very serious about your career. And yes routine bunks are part of college life and we do as well but obviously concerning our attendance. As far as my experience in this college it is the only institute in ipu that is strict for academics. My friend if you want relaxations and a very casual college life then iitm is not suitable.You must try for DU colleges jahan padai hi nhi hoti na attendan"
        },
        {
            "name": "Is it worth it to do an MS (part-time or full-time) at IITD/IITM?",
            "url": "https://www.quora.com/Is-it-worth-it-to-do-an-MS-part-time-or-full-time-at-IITD-IITM",
            "selection2": "Here is the lowdown on MS at IIT’s: 1. Profile: Best suited for self driven students with a passion for research as a career. GATE score a must followed by an interview and (or) written test. 2. Good stipend: unlike MS in USA which unless you are funded, leaves students in a lot of debt. 3. Career prospects: atleast so far as I have seen not really an issue since you either go on to do a PhD or look for a job in R&D, with your supervisor backing you. 4. Duties: As an RA or TA you have interaction with young undergrads with lot of ideas and possible collaborations. 5. Duration: 2–4 years (most likely 3). Entirely dependant on your thesis submission. 6. Infrastructure for research: While not all labs have the most state of the art infrastructure MHRD every year allocates substantial budget to develop the facilitie"
        },
        {
            "name": "Is MITR of IITM really helping people?",
            "url": "https://www.quora.com/Is-MITR-of-IITM-really-helping-people",
            "selection2": "This answer doesn't lead to a conclusion. So incase if you are expecting an yes or no to this question I would suggest you to not to read this. I am simply summarising my understanding of how MITR evolved during my graduation and also during my tenure as the Secretary(Hostel Affairs) How does MITR work?: * As such MITR is a highly volatile organisation due to the fact that it's head changes once almost every two to three years. * Working on MITR mostly depend on the Professor Incharge, Dean(Students) and the Director of the Institute. * Also note that they are answerable to the Ministry(HRD) regarding any unfortunate incident that happen in the institute. * Some Professors thought of MITR to be a more of counselling unit which would help the students who need the help. They were probably of the"
        },
        {
            "name": "Which IIT is better for aerospace engineering, IITM or IITK?",
            "url": "https://www.quora.com/Which-IIT-is-better-for-aerospace-engineering-IITM-or-IITK",
            "selection2": "Hello, Congratulations for getting through JEE Advanced 2017 !! I can understand your confusion since both are good institutes for pursuing Aerospace Engineering. Yes, IITK has an airstrip and a hangar equipped with 4/5 gliders. You can go in anytime and see those gliders. There is one whose skin has been ripped off so that you can see the structural arrangements of the glider. You get to have joy rides as well. I cannot compare the research facilities of IITM and IITK since I don’t have complete information about IITM. Besides, it would be unjust to compare the research facilities since both institutions have focus on different areas of research.However, I will let you know about the research facilities at IITK. The Aerospace Engineering department at IITK has four subsections- Aerodynamics,"
        },
        {
            "name": "How is IITM Janakpuri in terms of college life?",
            "url": "https://www.quora.com/How-is-IITM-Janakpuri-in-terms-of-college-life",
            "selection2": "IITM is a wonderful colg in both academic and enjoyment terms. Teacher over there are highly motivated to bring good results which you can see as well since most of the university topper are from iitm colg. Apart from academics all the extra curricular activities are held in iitm. Also it’s a chill place to hang out with friends. Strictness is medium. No formal dress. Wonderful freshers and farewell party."
        },
        {
            "name": "How could IITM bring Opeth for Saarang 2009?",
            "url": "https://www.quora.com/How-could-IITM-bring-Opeth-for-Saarang-2009",
            "selection2": "Saarang had a much larger budget in 2009 because it was IITM's Golden Jubilee Year. Opeth too had not yet achieved the level of fame it has today. Consequently, Opeth did not charge as much as it does now, and the amount charged then (which still was a tad higher than other bands) could be covered with the larger budget obtained."
        },
        {
            "name": "Why did you prefer IITM over IISC?",
            "url": "https://www.quora.com/Why-did-you-prefer-IITM-over-IISC",
            "selection2": "I would like to give different taste to this question. I'm currently studying at IISC doing PHD in Analog and RF circuits under Dr. Gaurab Banerjee. I'm talking strictly with respect to Analog and RF part of Microelectronics specialisation. 1)IITM has Prof Shanthi Pavan, nagendra krishnapura, Qadeer Khan, sankaran Aniruddhan, Saurabh Saxena who are working in Analog,RF,Mixed signal and power management fields. Hence you have more options to choose from according to your interest. In IISC we have only one professor(my guide) working in Analog and RF. Sometimes even he complains to students that he is the only one to teach Analog and integrated ckts for wireless communication courses. He wants another faculty in this field so that he can handover this basic courses to that faculty and he can"
        },
        {
            "name": "How is the hapkido class at IITM?",
            "url": "https://www.quora.com/How-is-the-hapkido-class-at-IITM",
            "selection2": "Hapkido is a martial art that originated in Korea. Unlike most other martial arts it is a thinking man's game. It does involve gruelling physical exertion and constantly pushes one to reach higher levels of fitness, but the challenge is what makes it all the more fun. The wide range of techniques that are taught involve understanding the mechanics of body movement and not just brute force. The instructors, being engineers, emphasize a lot on this aspect and thus enable us to appreciate and learn the techniques better. They involve a high degree of alertness and place a lot of emphasis on speed over power. There are three classes per week of two hours each for the first few ranks. People are welcome to attend a two week trial period prior to the beginning of every term. The term fee for t"
        },
        {
            "name": "Indian Institute of Technology, Madras (IITM): Is is worth waiting a year to work with Prof. Shanthi Pavan & Prof. Nagendra Krishnapura?",
            "url": "https://www.quora.com/Indian-Institute-of-Technology-Madras-IITM-Is-is-worth-waiting-a-year-to-work-with-Prof-Shanthi-Pavan-Prof-Nagendra-Krishnapura",
            "selection2": "Yes, we are damn lucky to have these profs. But, be careful what you wish for. I am way more proud of passing their course with a C grade than of clearing JEE or CAT."
        },
        {
            "name": "Why don't IITB and IITM rename itself as IITM and IITC respectively?",
            "url": "https://www.quora.com/Why-dont-IITB-and-IITM-rename-itself-as-IITM-and-IITC-respectively",
            "selection2": "Because they are names of organizations. This is precisely the reason why IIT Bombay is also not officially called IIT Powai, or IIT Madras, not called IIT Guindy. When they were established, they were located in places called Bombay and Madras, not Mumbai and Chennai. If this renaming goes through, imagine all the other renaming that should happen if you change the name of a city. You would then get IIM Bengaluru, Kolkata, etc. Mumbai High Court, Bengaluru High Court, Kolkata High Court, etc. Mumbai Gymkhana, Bengaluru Cantonment, etc. etc. etc. etc. Renaming something depends on the entity being renamed. Bombay, Madras, Calcutta and Bangalore cities wanted to be renamed. Organizations within those cities did not. That is why, we have IIT Bombay, Powai, Mumbai, India, as the address of IIT Bo"
        },
        {
            "name": "How can I access the IITM intranet from outside campus?",
            "url": "https://www.quora.com/How-can-I-access-the-IITM-intranet-from-outside-campus",
            "selection2": "This is a tutorial on how to use intranet using VPNCFE VPNC Front End Link to the software Follow the instructions in the video"
        },
        {
            "name": "Is the GATE mark considered in the MS and PhD programmes in IITM?",
            "url": "https://www.quora.com/Is-the-GATE-mark-considered-in-the-MS-and-PhD-programmes-in-IITM",
            "selection2": "Yes…. They do consider gate marks/score in ms interview (not sure about phd interviews)."
        }
    ]
}